{
	"generated": "Sat 22 Jan",
	"laws": [
		{
			"id": "933120192404410409",
			"last_message_id": "933812096121049131",
			"name": "Rewrite the consitution",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Louis:</b> I have rewritten the constitution, however discord doesn't let me send files in the starter message (unless I am missing something obvious).<br><b>Louis:</b> ```<br>The Constitution of New New Cheeseland (as written by Louis on Tuesday the 18th of <br>January 2022)<br><br>Each segment of the constitution has a different priority and and a different role, <br>I will try to explain the three ones that I have thought up here.<br><br>    1. Human rights - these are rights that every citizen of New New Cheeseland has <br>       and these cannot be broken in any circumstance, they are adapted from the<br>       UN human rights which can be found on their website here:<br>       https://www.un.org/en/about-us/universal-declaration-of-human-rights. You<br>       cannot change these.<br>       <br>    2. The Constitution - while it may seem counter-intuitive to have the Constitution <br>       only in the middle, I promise that there is good reasoning behind it. The <br>       purpose of the Constitution (in my opinion) is to define the <b>process</b> of<br>       governing New New Cheeseland nothing more. Therefore, it should be changed <br>       as few times as possible (perhaps only even in extenuating circumstances).<br>       The Constitution also defines how you should propose to change itself.<br>       <br>    3. Laws - these define, quite literally what you can and cannot do (although <br>       they will often have a more nuanced approach), they are designed to be able <br>       to be proposed as often as you want and the system for exactly how you should<br>       propose a new law will be defined in the Constitution below.<br>```<br><b>Louis:</b> ```<br><b>Human Rights</b><br> <br>Any citizen of New New Cheeseland is granted the following rights, the protocol for<br>what happens if they are broken is set out later on in this document in the <br>Constitution's section. As mentioned above, they are adapted from the UN's universal<br>declaration of human rights (with the more obvious and unnecessary ones removed).<br><br>    1. All people are free and shall be treated equally.<br>    <br>    2. <i>Everyone</i> is entitled to the freedoms set down here, regardless of race, colour,<br>       sex, language, religion, political or other opinion, national or social origin, <br>       property, birth or other status. Furthermore, no distinction shall be made on the<br>       basis of the political ideals of the person in question.<br>       <br>    3. Everyone has the right to recognition everywhere as a person before the law.<br>    <br>    4. All are equal in the eyes of the law and will be treated as such; the law shall<br>       not discriminate or set down double standards in regards to its judgements.<br>       <br>    5. No one shall be subjected to arbitrary imprisonment.<br>    <br>    6. Everyone is entitled to have a full and fair trial by an independent and <br>       impartial judge.<br>       <br>    7. i. Everyone has the right to be treated as if they are innocent before they<br>          are proven guilty.<br>       <br>       ii. No-one shall be charged for an offense that was not an offense at the time<br>           they committed it, or in fact the corresponding law was pending but not<br>           actually passed when they committed the aforementioned offense.<br>    <br>    8. Everyone has the right to thought, religion and belief. They also have the<br>       right to change these beliefs <i>at any time</i>.```<br><b>Louis:</b> ```<br>    9. Everyone has the right to an opinion and expression. This includes the freedom<br>       to hold opinions without interference and also express their opinion through<br>       any form of media (as long as that does not degrade another person due to the<br>       reasons listed in Act 2).<br>    <br>    10. Everyone has the right to take part in the political proceedings, without <br>        interference by any third party.<br>    <br>    11. Nothing in this document may be taken to imply that a person or group can <br>        participate in activity that is aimed to destroy the rights listed previously.<br>```<br><b>Louis:</b> ```<br><b>The Constitution</b><br><br>The document that lies thereafter defines how the country should be run and governed,<br>as well as the processes in place that will amend the constitution and any of the<br>laws that have been proposed.<br><br><i>Governing officials</i><br><br>The state is officially governed by a \"President\" who will hold all the power and is <br>the official \"Head of State\" if you like. The President will be voted in every two <br>weeks, any candidate who wishes to run for president should nominate themselves - <br><i>you cannot nominate someone other than yourself to run</i>. Anyone is able to vote in <br>this election, and after 24 hours have passed since the thread for the voting was opened<br>(NOTE: the thread does NOT have to be auto-archived), the candidate with the most votes<br>will become the President. The current president should hand over server ownership and <br>the corresponding roles at the latest opportunity (if possible), however, in case of<br>an ambiguous result, the outgoing President can stop this from happening until it<br>is absolutely clear who won. One President can only serve for two two week terms in a <br>row until they cannot run. Bots can NEITHER be President or run for the President. In<br>the case that the date for the Presidential election falls on a significant date (ex. <br>Christmas Day, Easter Sunday), then it may be offset by a few days (with the President<br>still taking power on the relevant day).<br><br>There is also a \"Prime Minister\", whose role is much like the President, but they are<br>more permanent. The Prime Minister is defined by the leader of the political party<br>who currently has the most members. Be clear though: it is still the President who is<br>in charge of the country, not the Prime Minister.<br>```<br><b>Louis:</b> ```<br>The Prime Minister and the President can pick ministers for the corresponding ministries<br>(NOTE: please do not feel obliged to pick only from the Prime Minister's party). Each<br>of the ministers should also be given the corresponding roles. Currently there are three<br>ministries:<br>    <br>    1. MfIA (Ministry for Internal Affairs) - used to report and prosecute any <br>       \"suspicious\" activity. I assume that this includes breaking laws... This<br>       ministry handles imprisonment.<br>    <br>    2. MfMaB (Ministry for Money and Bots) - acts like the Bank, (but not the bank)<br>       it manages the treasury and taxes. Paradoxically it seems like it not in fact<br>       in charge of Bots at all!<br>    <br>    3. MINFO (Ministry for Information) - manages the information (such as automatically<br>       counting which laws where passed or not), however you have to pay an extortionate<br>       amount if you want anything done.<br>```<br><b>Louis:</b> ```<br><i>Court cases</i><br><br>If someone feels like something has wrong them (or in the case of Twaddle, just want<br>a few extra CheeseCoin), then you can take someone to court. Try not to call one<br>on a whim... There are certain protocols in place to help it running smoothly.<br><br>    1. Make a thread in #court detailing who the defendant(s) is/are and who the <br>       prosecutor(s) is/are and what date the case is on.<br>       <br>    2. Choose someone who is pretty much impartial to be the judge, they may make<br>       the final ruling on whether or not the defendant is guilty or not guilty<br>       (and if they are guilty the sentence that they will be condemned to).<br>   <br>    3. Let the judge decide whether or not the court case should actually take place<br>       based upon the laws that have been passed, the constitution itself and <br>       occasionally, the human rights. <br>    <br>    3. Let both sides explain their arguments clearly and precisely (either side <br>       may hire someone else to do this for them), however, this is not strictly <br>       necessary but it would likely hinder the ability of the judge to make a fair <br>       and balanced decision after weighing up both the arguments if a side did not.<br>       <br>    4. The judge can now make a judgement on whether or not the defendant is guilty<br>       or not. I cannot stress enough that this MUST be fair and balanced. In the case<br>       that the defendant is found guilty of their crime then they can be given a <br>       choice between a fine of X amount of CheeseCoin, or X amount of days in prison.<br>       In the case that they cannot pay (ex. they don't have enough money, RoboLouis is<br>       buggy again), then they will have automatically chosen the prison option.<br>```<br><b>Louis:</b> ```<br><i>Monetary System</i><br><br>The official currency of New New Cheeseland is the CheeseCoin, although it is likely<br>obvious, there are the following rules surrounding the use of CheeseCoin.<br><br>    1. Do not give people negative amounts of CheeseCoin.<br>    2. You can not steal any amount of CheeseCoin or anything that is worth CheeseCoin.<br>    3. Do not give people an amount of CheeseCoin that is lower than 0.01 (simply because<br>       this is irritating and gains nothing).<br>    4. Do not attempt to \"cheat the system\" by thinking that floating point rounding <br>       errors will give you free CheeseCoin, they likely won't.<br>    5. Don't try and evade tax.<br><br>There is currently only one kind of tax, and that is wealth tax. Wealth tax is applied<br>every day (or the shortest possible time after one day has passed) to every user and <br>organisation (organisation being the umbrella term for accounts that are not users).<br>```<br><b>Louis:</b> ```<br><i>Organisations</i><br><br>The Constitution defines the following kinds of organisations:<br><br>    1. Non-profit organisations - these must make no kind of profit through their<br>       actions, be the profit be directly to the organisation or indirectly - through<br>       another third party. However, these organisations can accept donations from <br>       people.<br>    <br>    2. For-profit organisations (or businesses, as sane people call them) - these <br>       organisations are permitted to sell their wares.<br>    <br>    3. Parties - these organisations are defined as a political party, as mentioned <br>       above the leader of the largest political party will be the Prime Minister.<br>       Therefore, all political parties must declare a leader. (NOTE: You do not <br>       have to be in a party if you want to vote).```<br><b>Louis:</b> ```<br><i>Constitutional amendments</i><br><br>Ideally, constitutional amendments should not happen <i>that</i> often, however when the <br>need arises they do exist!<br><br>As you would with proposing a regular law, create a thread in #constitution but please<br>amend this document, send it and point out the changes that you have made, this makes it<br>a lot easier to maintain. Unlike laws, the outcome is decided 48 hours after the thread <br>was initially made (since constitutional amendments are so important!). You vote the same <br>way - explicitly with \"for\" or \"against\".<br>```<br><b>Louis:</b> ```<br><b>Laws</b><br><br>If you wish to propose a new law, then you would have to make a new thread in #parliament<br>with a pretty descriptive title on what your law actually achieves. A law is passed/denied<br>after 24 hours of the thread being made, again, NOT when the thread is auto-archived.<br><br><i>Voting</i><br><br>Since voting is counted automatically by MINFO, you have to explicitly say \"for\" or <br>\"against\" in your message, the last message containing these keywords being the one <br>that counts. If you mention both of these words on one message, then it is \"against\"<br>that will be counted.<br><br>You can vote as many times as you wish, however only your last vote will actually count<br>towards the total.<br><br><i>Overriding</i><br><br>Where-ever possible, new laws should not override older laws, however in the case of <br>a conflict, the law should make clear what aspects of the older law it is overwriting<br>to make it clear what the new situation is. If this is not the case then it will be<br>ambiguous.<br><br>The list of laws is not maintained in this document since that would take far too long<br>and would be painful to read. Look in MINFO's channel for the full list.<br>```<br><b>Louis:</b> Or if you prefer, I have the file that it was originally written in<br><b>Louis:</b> I don't expect everyone to read all of this because it is at least 1800 words long, however if you spot any obvious spelling/grammar errors please feel free to point them out.<br><br>Aside from that, anything on this document can be changed so please discuss!<br><b>Alan:</b> For<br><b>Twaddle:</b> Please change political thingy<br><b>Twaddle:</b> I will be against until this is done<br><b>Twaddle:</b> Against<br><b>Louis:</b> What thing?<br><b>Alan:</b> I think he means the bit with the president and prime minister<br><b>Louis:</b> I'm going to postpone this until <span class=\"ping\">#Our political situation</span> is passed<br>"
		},
		{
			"id": "932232562116538409",
			"last_message_id": "932288488181727312",
			"name": "Criminal records re-proposal",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> If you are found guilty in a court case, a 1-week ban is imposed on you being president, an MP or head of the bank. This begins after any imprisonment that may have occurred, and applies to all cases in the past week. <br><br>The judge can also impose a lifetime ban for cases of severe corruption, although this can be overturned.<br><b>James:</b> Against<br><b>James:</b> Everyone should be able to be an MP.<br><b>James:</b> Even if they are in jail<br><b>Alan:</b> (I am re-proposing this as it was defeated due to Louis saying ‘against’ incidentally even when he supported it)<br><b>James:</b> You have now voted against.<br><b>Alan:</b> For<br><b>James:</b> It is 4cc for me to regenerate the laws list.<br><b>Alan:</b> You will now be paid 5cc/week regardless of how much the laws list is updated<br><b>James:</b> I have not agreed to this contract.<br><b>Alan:</b> Neither did you agree to the first one<br><b>Alan:</b> <span class=\"ping\">#contracts</span><br><b>James:</b> against<br><b>Elliot:</b> Against<br>"
		},
		{
			"id": "932363472321269780",
			"last_message_id": "932363485344567397",
			"name": "GEMP (again)",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Turns out that this law wasn’t passed after all, so:<br><br>CheeseCoins exist and are the national currency. There are 500 in circulation. More can be printed if the President, PM, Treasurer and Bank all agree. For-Profit Organisations are legal and may sell items or services for CheeseCoin<br><b>Alan:</b> For<br>"
		},
		{
			"id": "931951774342996039",
			"last_message_id": "932358707021504542",
			"name": "Abolish transaction tax",
			"votes": "4-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Abolish transaction tax, again.<br><b>Alan:</b> For<br><b>James:</b> Against<br><b>Adam:</b> 🙄 jeez<br><b>Adam:</b> For<br><b>Adam:</b> @everyone vote againnnn<br><b>James:</b> Your vote caused the last thread not to be passed.<br><b>Adam:</b> no I was counting the votes dumb child lol<br><b>James:</b> You typed \"against\" in https://discord.com/channels/907657508292792342/931101955575664651/931244779516329985 meaning that by law you voted against<br><b>Adam:</b> god I hate loopholes<br><b>Adam:</b> anyway is anyone else voting?<br><b>Adam:</b> also I gtg<br><b>Elliot:</b> For<br><b>Louis:</b> For<br>"
		},
		{
			"id": "931836522204913695",
			"last_message_id": "931893766573404213",
			"name": "Change presidential term length",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Increase the presidential term length to 2 weeks, so presidents have more time to better achieve their ‘manifestos’.<br><b>Alan:</b> For<br><b>James:</b> Against<br><b>James:</b> Nobody has a manifesto anyway.<br><b>Louis:</b> For, I wanted this originally<br>"
		},
		{
			"id": "931834809536368680",
			"last_message_id": "931878242980360202",
			"name": "Presidential election (15.01.22)",
			"votes": "0-for-0-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> You may vote in one of one way:<br><br>(1) James<br><b>Alan:</b> (1)<br><b>Louis:</b> (1)<br><b>Louis:</b> seems quite one-sided ngl<br><b>Alan:</b> I was thinking that<br><b>James:</b> (1)<br><b>James:</b> agreed<br><b>James:</b> <span class=\"ping\">#announcements</span> <span class=\"ping\">#Change presidential term length</span><br>"
		},
		{
			"id": "931214921134383166",
			"last_message_id": "931269373694476388",
			"name": "No fishing in parliament",
			"votes": "1-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Fishing in parliament should be illegal because it is disruptive and annoying<br><b>Alan:</b> For<br><b>Twaddle:</b> Against<br><b>Louis:</b> AGAINST<br><b>James:</b> against<br><b>Louis:</b> fishing in parliament<br>"
		},
		{
			"id": "931101955575664651",
			"last_message_id": "931268006535901307",
			"name": "Abolish Transaction tax",
			"votes": "2-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Abolish transaction tax<br><b>Alan:</b> For<br><b>Louis:</b> For<br><b>Louis:</b> <span class=\"ping\">@Adam</span> your manifesto<br><b>Twaddle:</b> Against<br><b>Louis:</b> Noooooo Twaddle I don't want to program this<br><b>Twaddle:</b> <span class=\"ping\">@Louis</span> gibe cheesebot admin says <span class=\"ping\">@James</span><br><b>Twaddle:</b> <span class=\"ping\">@Adam</span> <span class=\"ping\">@Alan</span> James told me to ping you<br><b>Twaddle:</b> <span class=\"ping\">@Twaddle</span><br><b>Twaddle:</b> <span class=\"ping\">@Louis</span><br><b>Twaddle:</b> <span class=\"ping\">@James</span><br><b>Alan:</b> <span class=\"ping\">@Twaddle</span><br><b>Twaddle:</b> @everyone<br><b>Louis:</b> I have done this (I think)<br><b>Louis:</b> https://discord.com/channels/907657508292792342/928701333366784031/931214530132992121<br><b>James:</b> against<br><b>Adam:</b> finally there we go<br><b>Adam:</b> For<br><b>Adam:</b> (for means remove it I think)<br><b>Louis:</b> yep<br><b>Adam:</b> (ok ty)<br><b>Adam:</b> For: 3<br>Against: 2<br><b>James:</b> 😦<br>"
		},
		{
			"id": "930853690271752223",
			"last_message_id": "930862043123302401",
			"name": "Copyright Laws 5",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> You can give someone permission to redistribute your copyrighted work without a court case taking place.<br><b>Alan:</b> For<br><b>Louis:</b> For<br>"
		},
		{
			"id": "930488069411454976",
			"last_message_id": "930494209285312563",
			"name": "Abolish Bank Holidays",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Abolish bank holidays because they have no use, as evidenced through the fact they have never been used seriously, and were likely created by Twaddle out of spite.<br><b>Alan:</b> For<br><b>Twaddle:</b> Against<br><b>Louis:</b> For<br><b>Alan:</b> Why? <span class=\"ping\">@Twaddle</span><br><b>Twaddle:</b> Because no<br>"
		},
		{
			"id": "930377583986618378",
			"last_message_id": "930489379200331837",
			"name": "Abolish wealth tax",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Abolish wealth tax<br><b>Alan:</b> Against<br><b>Twaddle:</b> For<br><b>Twaddle:</b> <span class=\"ping\">@D-Man</span><br>"
		},
		{
			"id": "930160242958925824",
			"last_message_id": "930210561256480798",
			"name": "Abolish transaction tax",
			"votes": "0-for-2-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> I propose to abolish transaction tax, and either:<br><br>(1) Up wealth tax to 10%<br><br>or<br><br>(2) Introduce business, VAT and income tax<br><b>Alan:</b> (2)<br><b>Twaddle:</b> Against<br><b>Alan:</b> What do you mean?<br><b>Twaddle:</b> i want neither<br><b>Twaddle:</b> i want to abolish wealth tax instead<br><b>James:</b> Against<br>"
		},
		{
			"id": "930127163540271124",
			"last_message_id": "930141533104136312",
			"name": "Bot code and concepts can be copyrighted without having to send the government the source code",
			"votes": "2-for-2-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Title says all<br><b>Twaddle:</b> For<br><b>Alan:</b> Against<br><b>Twaddle:</b> <span class=\"ping\">@Louis</span><br><b>Alan:</b> This will just confuse things in court<br><b>Twaddle:</b> No you literally just want yo! Bots source code<br><b>Alan:</b> Yes…<br><b>Alan:</b> Because I hold the belief that source code should be submitted to the copyright office<br><b>Twaddle:</b> No<br><b>James:</b> Against<br><b>James:</b> <span class=\"ping\">@Twaddle</span> Why bother copyrighting it if it is closed source?<br><b>Louis:</b> True<br><b>Louis:</b> For<br>"
		},
		{
			"id": "930132146591514674",
			"last_message_id": "930141582110371990",
			"name": "Copyright Laws p.4",
			"votes": "1-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > The copyright must have access to the file etc. in order for it to be approved for copyright<br><b>Alan:</b> For<br><b>James:</b> Against<br><b>Twaddle:</b> Against<br><b>Louis:</b> Against<br>"
		},
		{
			"id": "929838491968339979",
			"last_message_id": "930137222949249024",
			"name": "Presidential Election (08.01.22) - Take 2",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> You may vote in one of three ways:<br><br>(1) Elliot - CCP member<br>(2) Twaddle - Link Party member<br>(3) Adam - Link Party member<br><b>Louis:</b> (3)<br><b>Twaddle:</b> (2)<br><b>Adam:</b> (3)<br><b>Louis:</b> <span class=\"ping\">@Elliot</span> we have someone to vote for!<br><b>Alan:</b> (2)<br><b>Elliot:</b> (3)<br><b>James:</b> (3)<br>"
		},
		{
			"id": "929305234029834250",
			"last_message_id": "929737757557932072",
			"name": "What if there are no (elegible) presidential candidates?",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> This is the first use of multi-option voting:<br><br>(1) The election should be run again until a candidate can be reached<br>(2) the prime minister should assume the role of president<br>(3) the previous prime minister should serve an extra term (this does not count towards their overall consecutive term limit)<br>(4) the prime minister should nominate a new president<br><b>Alan:</b> (1)<br><b>James:</b> I vote that there should be no president.<br><b>James:</b> The prime minister should be server owner<br><b>Adam:</b> oh god an anarchist<br><b>Adam:</b> what if they abuse that given power, we cannot keep making new servers to fix this<br><b>James:</b> What if the current server owner abuses that power??????????????????<br><b>James:</b> Changing the person does not stop the natural human lust for power.<br><b>Adam:</b> however, would u agree some real life past presidents have been better than others<br><b>Adam:</b> it all depends on if they would make a good one or not<br><b>Adam:</b> if the current server owner would make a just and fair president then maybe that idea should become a reality, however if they are corrupt, evil, and unfair then we would be stuck with them unless a new server was made. this is why we should either find the perfect president or keep on electing new ones<br>"
		},
		{
			"id": "929294615641718825",
			"last_message_id": "929294618326081566",
			"name": "Presidential Election (08.01.22)",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> The candidates for today’s election are as follows:<br><br>(1) <span class=\"ping\">@R. Louis</span> <br><br>Remember, bots cannot be president.<br>"
		},
		{
			"id": "929062463821979750",
			"last_message_id": "929115844406038558",
			"name": "Judge qualifications",
			"votes": "2-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> If a judge does not understand relevant legislation in the case they are judging, they must (a) attempt to understand it (b) ask <span class=\"ping\">#minfo</span>, or (c) resign from being judge. (in the event of option (c) the defence and prosecution must elect a new judge as specified in the original GLUMP law).<br><b>Alan:</b> For<br><b>James:</b> Against - this will make my life harder because I am often chosen as judge.<br><b>Elliot:</b> against<br><b>Louis:</b> if they don't understand it then it is probably unclear and not conclusive evidence. refer to what actually happens in court https://www.hse.gov.uk/enforce/enforcementguide/court/rules-key.htm#P1_41<br><b>Twaddle:</b> For<br><b>Alan:</b> <span class=\"ping\">@Twaddle</span> sort out your roles<br><b>Alan:</b> You should be president<br><b>Louis:</b> against<br>"
		},
		{
			"id": "928716253869273178",
			"last_message_id": "929091257454718996",
			"name": "Copyright Laws",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > Any text, images or other media can be copyrighted for free at a government office created if this law is passed. The purpose of this office is to validate the copyright. If approved, any reproduction and redistribution of this work is illegal and leads to a court case. If not approved, then the person can take the copyright office to court<br><b>Alan:</b> for<br><b>James:</b> For<br><b>James:</b> I'm going to copyright location<br><b>Alan:</b> location?<br><b>James:</b> location<br><b>James:</b> indeed<br><b>James:</b> if you are violating my copyright then you will be taken to court<br><b>James:</b> and I will recieve the required compensation.<br><b>James:</b> if you do not allow me to copyright location then you will be taken to court.<br><b>Alan:</b> Please also vote in #More copyright laws<br><b>Alan:</b> or <span class=\"ping\">#Even more copyright laws</span><br>"
		},
		{
			"id": "929058323691610152",
			"last_message_id": "929059119124578316",
			"name": "Even more copyright laws",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> You can only apply for copyright on text or media that you have created yourself.<br><b>Alan:</b> For<br><b>James:</b> I will copyright location as the text of the essay I created myself exists in a location<br>"
		},
		{
			"id": "929037914984284160",
			"last_message_id": "929057902570926221",
			"name": "More copyright laws",
			"votes": "0-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> You can only copyright something you own.<br><b>James:</b> Against<br><b>James:</b> this is very unclear<br><b>James:</b> I could argue that I own location as I bought a book that comes with a location.<br><b>Alan:</b> agreed<br><b>Alan:</b> against<br>"
		},
		{
			"id": "928327532560920607",
			"last_message_id": "928339618569531442",
			"name": "Bot rights",
			"votes": "3-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > Bots cannot be imprisoned taken to court, be an MP/the president. All bot requests must be approved by the MfEA, and it costs 1cc for bots to be added. Bots may only have permissions that are strictly necessary for them to function, and may not Moderator-level permissions or higher.<br><b>Alan:</b> For<br><b>Louis:</b> For<br><b>Louis:</b> I'd also like bots to have a user guide mandate the usage of slash commands<br><b>Elliot:</b> Wait<br><b>Elliot:</b> I think about government<br><b>Elliot:</b> A bot should have all the rights of a human.<br><b>Elliot:</b> Against<br><b>Twaddle:</b> For<br>"
		},
		{
			"id": "928319072855285840",
			"last_message_id": "928339254151622677",
			"name": "Contract update",
			"votes": "3-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> This shall be added on to the contract laws:<br>Contracts may include a clause on a punishment if it is broken, however if this is a sum of money to be paid to the other contractee the limit is 10 cheesecoin. The judge may also deem a punishment too harsh and give his own instead<br><b>Twaddle:</b> For<br><b>Alan:</b> Against - there should be no limit on fines.<br><b>Louis:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "928317754501652490",
			"last_message_id": "928339140976721990",
			"name": "Multi option voting",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> If there are multiple options on what iteration of a law may be implemented then this procedure shall be used:<br>(1)explanation<br>(2)explanation<br>(3)explanation<br><br>To vote for (1) you would say:<br>For (1)<br>This is the same for all other options<br>If you agree with none of these option then say:<br>Against<br><b>Twaddle:</b> People are encouraged to put options that may not be their own view when creating a new law to create less hassle<br><b>Twaddle:</b> For<br><b>Alan:</b> For<br><b>Louis:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "928323448479051776",
			"last_message_id": "928339410259431515",
			"name": "Bot laws",
			"votes": "1-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> All bots must have an owner, this owner is recorded by the mfea, if a bot does not have an owner declared within two days of this laws passing it shall be kicked, when a bot is to join the server its owner must be declared before it is let in. Bots must be let into the server unless a law or other good reason prevents it. A bot has two options, to be political and be able to vote, have government roles and be president or prime minister, these bots must also have bank accounts and may go to jail. The second option is for the bot it be non-political, meaning it cannot vote, take on government roles , have a bank account or go to jail. This status must also be declared by the owner and recorded by mfea. There may only be one political bot per person to prevent spam bot voting, this is backed up by the mfea record<br><b>Twaddle:</b> For<br><b>Alan:</b> Against<br><b>Louis:</b> Against<br><b>Elliot:</b> Against<br><b>Elliot:</b> This is against bots!<br>"
		},
		{
			"id": "928327740288020572",
			"last_message_id": "928333632425308170",
			"name": "New CAs override old CAs",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > The same as with New laws override old laws but for Constitutional amendments.<br><b>James:</b> Against<br><b>Alan:</b> For<br><b>James:</b> <span class=\"ping\">@Deleted User</span> ?<br><b>Alan:</b> Hello!<br><b>James:</b> Why are you <span class=\"ping\">@Deleted User</span> ?<br><b>Alan:</b> Because I am the prime minister<br><b>Louis:</b> Amendment kinda implies that it would change it<br><b>Louis:</b> Why against James?<br>"
		},
		{
			"id": "926917191960514561",
			"last_message_id": "928006393997426779",
			"name": "allow bots to be president",
			"votes": "2-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Louis:</b> at the request of alan, i am making this amendment because #Allow bots was not good enough<br><b>Louis:</b> for<br><b>Louis:</b> <span class=\"ping\">@Elliot</span> we need to get this through!!<br><b>Alan:</b> Against - how exactly a bot would govern is unclear.<br><b>Louis:</b> im not even sure you are allowed to give bots ownership<br><b>Louis:</b> ah well<br><b>Elliot:</b> For<br><b>Elliot:</b> This will clear things up<br><b>Alan:</b> Exactly<br><b>Twaddle:</b> Against<br><b>Alan:</b> <span class=\"ping\">@Twaddle</span> you aren’t an MP so you can’t vote…<br><b>Alan:</b> Exactly<br><b>Louis:</b> This is passed<br><b>Louis:</b> Albeit that Alan has decided to try and keep the thread open<br><b>Alan:</b> <:downvote:922104870696263680><br><b>Twaddle:</b> Against<br><b>Louis:</b> Why are you voting ages after it was passed<br><b>Twaddle:</b> Alan convinced me to<br><b>Twaddle:</b> Also if it hasn’t closed it isn’t passed?<br><b>Louis:</b> closed in what way?<br><b>Louis:</b> 24 hours passed since I proposed it (and more)<br><b>Louis:</b> anyway, Alan shouldn't be convincing you of how you should vote on a law<br><b>Twaddle:</b> The threads close<br><b>Alan:</b> He archived it<br><b>Twaddle:</b> He is a political, this is his job<br><b>Louis:</b> i archived this thread?<br><b>Alan:</b> I unarchived it?<br><b>Louis:</b> no, just that i never did archive it<br><b>Twaddle:</b> Look I will let you two settle this cause I couldn’t care less<br><b>Louis:</b> good :)<br><b>Alan:</b> This all seems very messy<br><b>Alan:</b> I say we just leave this thread alone<br><b>Louis:</b> or we can archive it and say it has been passed (which it did)<br><b>Elliot:</b> Yes<br><b>Elliot:</b> Let’s do that<br><b>Alan:</b> If you do so, I will add to the long list of charges in our court case<br><b>Louis:</b> go ahead<br><b>Alan:</b> I shall<br>"
		},
		{
			"id": "928016850795773982",
			"last_message_id": "928019457366974555",
			"name": "change thread archiving rules",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Louis:</b> make it so that the law is passed/denied not when the thread is archived but 24 hours after the thread was created, this makes <span class=\"ping\">#Illegal to prolong laws from being passed</span> redundant and also stops annoying people from keeping threads unarchived<br><b>Louis:</b> for (obviously)<br><b>Alan:</b> Against<br><b>Louis:</b> why?<br>"
		},
		{
			"id": "928018624176881764",
			"last_message_id": "928018958559350826",
			"name": "Contracts exist and are legally binding",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Contracts can be made by two people who both agree to a set of conditions, contracts are legally binding and if one someone breaks a contract, the other person involved can take them to court. However if it is ruled the contract is either misleading and disingenuous or breaks any other law of the third cheeselandic republic the contract will be broken and the prosecution fined. Contracts may only last 30 days , the date of creation must be written on the contract so this may be confirmed or the contract is invalid, finally a new channel called contracts shall be created and all contracts must be posted in there or will not be legally binding<br><b>Twaddle:</b> The 30 day rule is so someone cannot just sign away their life and all their money forever<br><b>Alan:</b> For<br>"
		},
		{
			"id": "927877913620140082",
			"last_message_id": "927946851443937280",
			"name": "Illegal to prolong laws from being passed",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > If someone believes you are deliberately prolonging a law from being archived, then they can take them to court.<br><b>Alan:</b> For<br><b>Louis:</b> Why don't we make it so it is 24 hours after the law was proposed rather than the thread archived<br><b>Alan:</b> You can<br><b>Elliot:</b> For<br><b>Louis:</b> For anyway<br>"
		},
		{
			"id": "927159160305492051",
			"last_message_id": "927253068427427870",
			"name": "Co-Presidency",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> In the event of a draw in a presidential election, a co-presidency is created. Here, both have presidential duties however only one has server ownership. Which president gets server ownership is chosen by the Prime Minister.<br><b>Alan:</b> For<br><b>Elliot:</b> For<br><b>Louis:</b> against, a draw should never be allowed to happen<br><b>Alan:</b> What do you propose happens instead?<br><b>Alan:</b> In the event of a draw<br><b>Louis:</b> there will never be a draw due to there being 9 humans in the server<br><b>Alan:</b> What if 3 people run?<br>"
		},
		{
			"id": "926612404522086461",
			"last_message_id": "926952195520356433",
			"name": "Presidential election (01.01.22)",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> @everyone <br>Vote for who should be president for the 01.01.22-08.01.22 term. The candidates are as follows:<br><br>(1) Twaddle (independent)<br>(2) CheeseBot (Bot - independent)<br><b>Alan:</b> (1)<br><b>Elliot:</b> 2<br><b>Louis:</b> Is there only twaddle running then?<br><b>Elliot:</b> no i think cheesebot is<br><b>Louis:</b> (2)<br><b>Louis:</b> #cheesebot for the win<br><b>Twaddle:</b> (1)<br><b>Louis:</b> we need more votes<br><b>Louis:</b> <span class=\"ping\">@James</span><br><b>Twaddle:</b> <span class=\"ping\">@Alan</span>  is this legitimate<br><b>Louis:</b> what is legitimate<br><b>Twaddle:</b> Do we have confirmation from cheesebot that they want to run<br><b>Louis:</b> <span class=\"ping\">@Cheese Bot</span><br><b>Alan:</b> <span class=\"ping\">@Twaddle</span> There is no law saying they must agree to run. You can vote to change this in <span class=\"ping\">#Candidate Laws</span><br><b>Twaddle:</b> Also isn’t it illegal for a bot to be president<br><b>Alan:</b> True. CheeseBot can run for president, but cannot be the president.<br><b>Twaddle:</b> I see an issue here<br><b>Alan:</b> (Elliot's law only stated that bots where allowed to be prime minister, and that law is pretty vague in its wording)<br><b>Alan:</b> What?<br><b>Twaddle:</b> The fact it can run but not be prime minister<br><b>Twaddle:</b> Do we simply deny its prime minister ship?<br><b>Alan:</b> How is this an issue?<br><b>Twaddle:</b> Do we take it to court?<br><b>Twaddle:</b> Also gtg<br><b>Twaddle:</b> <i>president<br><b>Alan:</b> yes<br><b>Alan:</b> In which case you will be the president.<br><b>Louis:</b> i would like to point out that the allow bots constitutional amendment was proposed before the semi-presidential system amendment was passed<br><b>Louis:</b> at that point 'prime minister' and 'president' pretty much referred to the same thing<br><b>Elliot:</b> I say cheesebot can be president<br><b>Elliot:</b> Due to Louis’ point<br><b>Alan:</b> You should have then held a re-vote.<br><b>Alan:</b> (On a different law)<br><b>Elliot:</b> No<br><b>Elliot:</b> I think that we should allow it to happen<br><b>Elliot:</b> And if you don’t then you can take us to court<br><b>Louis:</b> why<br><b>Alan:</b> The Restrictions on who can be president CA clearly says \"You cannot be a bot and the president\". The allow bots CA allows bots tobe the prime minister<br><b>Louis:</b> where is this again?<br><b>Alan:</b> https://discord.com/channels/907657508292792342/907661773925126164/918958776541917255<br><b>Louis:</b> surely <span class=\"ping\">#Allow bots</span> overrides this<br><b>Alan:</b> That law states that the bot can be the prime minister, not the president.<br><b>Louis:</b> https://http.cat/508<br><b>Louis:</b> refer back to my original point<br><b>Alan:</b> The meaning of these terms clearly changed, changing what the original Allow Bots law meant. If you wanted to revert back to the original meaning,you shoudl have proposed a law to change it.<br><b>Louis:</b> if we must have to go through this<br><b>Louis:</b> you can cry about it in <span class=\"ping\">#allow bots to be president</span><br><b>Elliot:</b> No look<br><b>Elliot:</b> I have no problem with this<br><b>Elliot:</b> If you have a problem with this, sue us<br><b>Alan:</b> Sure<br>"
		},
		{
			"id": "926767280854020126",
			"last_message_id": "926769122405130240",
			"name": "Candidate Laws",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > Candidates must submit their name by 23:59 on the day before an election.<br>> If candidates wish to pull out of the election, they must do so before 23:59 on the day before.<br>> Candidates must nominate themselves - you cannot force someone else to run.<br><b>Alan:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "926768161540440114",
			"last_message_id": "926769065354219563",
			"name": "Wills",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > In the event that someone where to leave New New Cheeseland, they would formalise this by deleting their bank accounts. However, if they wrote a will before hand, their assets will be distributed from the treasury (where money from deleted bank accounts goes?). Their businesses will also be held by the government, who can choose what to do with them (unless otherwise stated in the will).<br><b>Alan:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "923493416829091840",
			"last_message_id": "923657548454854726",
			"name": "Presidential Election (23.12.21)",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Vote for who should be the next president, they will not take office until the 25th. The candidates are as follows:<br><br>(1) Elliot (CCP party member)<br>(2) Twaddle (Independent)<br><br>Voting will close at 23:59<br><b>Alan:</b> (2)<br><b>Louis:</b> (1)<br><b>Twaddle:</b> (2)<br><b>Louis:</b> @everyone we need more votes!<br><b>Twaddle:</b> Yes we do<br><b>Elliot:</b> (1)<br><b>Louis:</b> It is tied so we'll need some more votes!<br><b>Alan:</b> What happens in the case of a draw?<br><b>Louis:</b> I have no idea<br><b>Alan:</b> <span class=\"ping\">@James</span> <span class=\"ping\">@Xohng Xina and De Wok</span> <span class=\"ping\">@Chino</span> <span class=\"ping\">@D-Man</span> vote<br><b>James:</b> (1)<br>"
		},
		{
			"id": "923243305746178088",
			"last_message_id": "923277180333600878",
			"name": "Prime minister and president refer to the same thing",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>James:</b> Under this law, the president and the prime minister will be the same person, chosen by the already established vote on Saturdays. <br><br>This replaces the current system where Alan's interpretation of the law allows two different people to occupy these roles.<br><br>For<br><b>Louis:</b> but, there was a law about the semi-presidential system<br><b>Elliot:</b> yeah i<br><b>Elliot:</b> i dont know<br><b>Louis:</b> alan made this law<br><b>Elliot:</b> Im just gonna pass on this one<br><b>Elliot:</b> and stay neutral<br><b>James:</b> But this law removes all confusion<br><b>James:</b> Alan is just trying to gain power without you noticing<br><b>James:</b> But this law would prevent that.<br><b>Alan:</b> Against - this will inevitably lead to corruption as one person holds all the power.<br><b>Louis:</b> Against as well then<br><b>Louis:</b> but there was a vote on this? that is hardly sneaky<br><b>Alan:</b> In addition, each of these have their own defined roles as per the earlier law.<br>"
		},
		{
			"id": "922880464228872213",
			"last_message_id": "922886527753785414",
			"name": "Make an exception for dates such as Christmas, Easter",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> I do not think that any sort of votes should be held on significant dates ex. Christmas Day, Boxing Day, this is because of the upcoming presidential election falls on Saturday (as it should) but this Saturday happens to be Christmas Day!<br><b>Louis:</b> For (obviously)<br><b>Alan:</b> For<br><b>Alan:</b> It should go to closest date or the day after.<br><b>Louis:</b> Which would be Monday 27th?<br><b>Alan:</b> The closest date is the 24th - however arguably that is too intrusive as well<br><b>Louis:</b> Oh yeah you can do it before as well 🤣<br><b>Louis:</b> So between the 23rd and 27th I suppose<br><b>Louis:</b> I think that the 23rd is better personally...<br><b>Alan:</b> How about, hold the vote on the 23rd, but the new president won’t take office until the 25th<br><b>Louis:</b> Fair enough<br><b>Alan:</b> That way no-one serves a shorter or longer term<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "922436378405502976",
			"last_message_id": "922465000650592297",
			"name": "Definition of Corruption",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> “Corruption is a form of dishonesty or a criminal offense which is undertaken by a person or an organization which is entrusted with a position of authority, in order to acquire illicit benefits or abuse power for one's personal gain.” In the eyes of the law. You must provide reasoning in court as to how what someone has done fits this definition.<br><br>Source: Wikipedia<br><b>Alan:</b> For<br><b>Louis:</b> For this<br><b>James:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "922432729155522590",
			"last_message_id": "922434919265861672",
			"name": "Criminal Records",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> If you are found guilty in a court case, a 1-week ban is imposed on you being president, an MP or head of the bank. This begins after any imprisonment that may have occurred, and applies to all cases in the past week. <br><br>The judge can also impose a lifetime ban for cases of severe corruption, although this can be overturned.<br><b>Alan:</b> For<br><b>Louis:</b> For<br><b>Louis:</b> we need a <i>more</i> accurate definition of __corruption__ though because at the moment it is just thrown around when someone does something that should be against the laws but isn't because there was never a law passed that says that they can't do (something)<br><b>Alan:</b> Yes<br>"
		},
		{
			"id": "922098050686677012",
			"last_message_id": "922247091068223528",
			"name": "More Voting and Electoral Procedure",
			"votes": "5-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Voting is done based on Discord accounts, as follows:<br><span class=\"ping\">@James</span> is James<br><span class=\"ping\">@Alan</span> is Alan<br><span class=\"ping\">@Louis</span> is Louis<br><span class=\"ping\">@Twaddle</span> is Twaddle<br><span class=\"ping\">@Elliot</span> is Elliot<br><span class=\"ping\">@Xohng Xina and De Wok</span> is Elliott<br><span class=\"ping\">@Adam</span> is Adam<br><span class=\"ping\">@Chino</span> is Chino<br><span class=\"ping\">@D-Man</span> is Donny<br><br>Only these accounts may vote. If a new person joins the country, then their account is added to this list. You may not vote on behalf of another account.<br><b>Alan:</b> For<br><b>James:</b> For<br><b>Xohng Xina and De Wok:</b> For<br><b>Elliot:</b> For<br><b>Louis:</b> For<br>"
		},
		{
			"id": "922168756132786216",
			"last_message_id": "922223313768579102",
			"name": "Abolish Vice-President",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Due to there being confusion around whether or not the Vice-President law was passed, the role should be abolished as it does nothing<br><b>Alan:</b> For<br><b>James:</b> For<br>"
		},
		{
			"id": "922116050559074354",
			"last_message_id": "922119393167691797",
			"name": "Allow bots",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Elliot:</b> Change the restrictions of prime minister to allow bots<br><b>Elliot:</b> For<br><b>Elliot:</b> it would be realistic<br><b>Louis:</b> For<br><b>Alan:</b> Against<br>"
		},
		{
			"id": "922114821082726441",
			"last_message_id": "922119927639466026",
			"name": "Limit on threads that can be open at one time",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> I feel as if the political climate of new cheese land is moving fast, it is up to interpretation if this is a good or bad thing, the only problem is I feel as if it is somewhat hard to keep up with new cheeseland politics for those who may be taking a break or have forgotten to read their parliament threads, therefore I think there should be a limit of 3 parliament threads open at once<br><b>Twaddle:</b> For (obvs)<br><b>Alan:</b> Against - this can be easily abused by creating threads and keeping them open, thus preventing anyone from creating more threads<br><b>Twaddle:</b> Oh yes I shall re-propose this with this in mind<br><b>Twaddle:</b> I will close this thread in 2 hours<br>"
		},
		{
			"id": "922099207131762718",
			"last_message_id": "922119280005357568",
			"name": "Party must accept new votes",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> New members of a party must be accepted by the current party leader (self appointed if there is none) before joining the party.<br><br>For<br><b>Louis:</b> For<br><b>Elliot:</b> For<br><b>Alan:</b> For<br>"
		},
		{
			"id": "922093893347078144",
			"last_message_id": "922115862532595752",
			"name": "Court case requirement",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> For a fair and civil land, this constitutional amendment means everyone is entitled to a court case if it is believed that they have broken the law. They may not be fined or imprisoned unless the verdict is guilty.<br><br>It is the responsibility of the police to become the prosecution and the defendant may plead either `guilty` or `not guilty`.<br><b>James:</b> For<br><b>Alan:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "922102734331707463",
			"last_message_id": "922115679178608651",
			"name": "Semi-Presidential System",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> To be more in line with real governmental structures, I propose that we adopt a semi-presidential system as seen in many real-world countries like France, Portugal, Poland, Russia, and <i>Taiwan</i>. This means we have both a president and a prime minister. The president is elected in the weekly votes, while the Prime Minister (PM) is the head of the largest political party. The President and PM may come from the same political party but may not be the same person. The president acts as the figurehead for the nation and is server owner, counting votes on laws as well as managing roles and channels etc.<br><br>The PM, on the other hand, is the head of the government. They appoint the Treasurer (AKA the bank), and also other members of their cabinet like police etc. (They can also self-appoint themselves if they see fit). This gives us the advantages of both the presidential system we use now and the parliamentary system we used to use, and also makes it less likely for corruption to occur in the highest ranks of the government, ensuring stability.<br><b>Alan:</b> For<br><b>Elliot:</b> For<br><b>Elliot:</b> but can we call them the chancellor<br><b>Elliot:</b> (makes it simpler)<br><b>Alan:</b> Who exactly?<br><b>Elliot:</b> the president<br><b>Elliot:</b> its just easier to understand the difference that wat<br><b>Elliot:</b> <i>way<br>"
		},
		{
			"id": "921412711458422825",
			"last_message_id": "922092803578810398",
			"name": "Presidential Election (18 December)",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> This is the presidential election for the term 18 December to 25 December as has been voted in the Become a Republic Constitutional Amendment. <br><br>The candidates are below:<br>1. Elliot Freudenburg - <span class=\"ping\">@Elliot</span> (CCP member)<br>2. Elliott Morgan - <span class=\"ping\">@Xohng Xina and De Wok</span>  (link party member)<br>3. Louis <span class=\"ping\">@Louis</span> (CCP party leader)<br>4. Luke Twaddle - <span class=\"ping\">@Twaddle</span> (No party)<br><br>All <span class=\"ping\">@Deleted User</span>s are invited to vote. Please state the number of the candidate you wish to vote for. You may vote for yourself. Votes will be counted on Sunday.<br><b>Alan:</b> I am not running any more<br><b>Alan:</b> I believe Louis is<br><b>Adam:</b> m<br><b>Adam:</b> nothing<br><b>Adam:</b> NO<br><b>Adam:</b> 2<br><b>James:</b> 3<br><b>Elliot:</b> vote me<br><b>Elliot:</b> 1<br><b>Alan:</b> 3<br><b>Louis:</b> 3<br><b>Twaddle:</b> 3<br><b>Twaddle:</b> As Alan Smith I vote 4<br><b>Louis:</b> this is luke?<br><b>Twaddle:</b> As luke twaddle I also vote 4<br><b>Louis:</b> this is out of date as it is last year's bus pass!<br><b>Twaddle:</b> Umm no<br><b>Twaddle:</b> Very legitimate<br><b>Alan:</b> That's a 30cc fine Twaddle<br><b>Alan:</b> Pay it to the treasury 🙂<br><b>Alan:</b> > Naming yourself or your organisation in a way that is seen as unhelpful or misleading will have a 30cc fine or a 3 day jail sentence.<br><b>James:</b> You can't take the jail sentence 🙂<br><b>Alan:</b> As prison has not been implemented yet you'll have to pay the fine<br><b>Alan:</b> <span class=\"ping\">@Twaddle</span><br><b>James:</b> Evidence.<br><b>Twaddle:</b> Can I please have a court case and the name of the thread that says this<br><b>James:</b> sure<br><b>James:</b> I will count this as a vote for Twaddle, overriding your previous vote of Louis.<br><b>Twaddle:</b> Give me the thread name!<br><b>James:</b> Results for yesterday's election!<br><b>Alan:</b> Ban on mis-naming yourself or your organisation<br><b>Alan:</b> What exactly are you taking me to court for? <span class=\"ping\">@Twaddle</span><br><b>James:</b> Go to <span class=\"ping\">#court</span><br><b>Alan:</b> Ok<br>"
		},
		{
			"id": "921416522818277426",
			"last_message_id": "921436300882608148",
			"name": "Partial Ban on political advertising",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > It is illegal for political parties to advertise in any channel other than their own named channel.<br><b>Alan:</b> For<br><b>Alan:</b> Partial Ban on political advertising<br><b>Louis:</b> For, we shall advertise the CCP in <span class=\"ping\">#ccp</span><br>"
		},
		{
			"id": "921413104858984521",
			"last_message_id": "921414287887577088",
			"name": "Bank Manager Applications",
			"votes": "0-for-0-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>James:</b> If you wish to become manager of the bank then please apply here. There is no Government-Bank contract. Please apply with a)qualifications b)experience and c)why you will be a good candidate.<br><b>Alan:</b> > (a) I got a predicted 9 in maths and banking is about maths (b) I have been the head of the bank since the nation was founded (c) Nothing has ever gone wrong with me as head of the bank<br><b>James:</b> You seem like a reasonable candidate.<br>"
		},
		{
			"id": "920748069946015774",
			"last_message_id": "920754568311222354",
			"name": "Quick ammendment",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Elliot:</b> Change the restrictions of prime minister to allow bots<br><b>Louis:</b> FOR<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "920347050007224321",
			"last_message_id": "920373528967118928",
			"name": "audit logs should be public",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> I think that the audit logs should be public to be viewed by everyone for transparency.<br><b>James:</b> Against - corruption adds variety.<br><b>Louis:</b> ???<br><b>James:</b> ???<br><b>Louis:</b> What do you mean by this<br><b>James:</b> I mean that corruption adds a level of depth to the game.<br><b>James:</b> ???<br><b>James:</b> I mean that corruption adds variety.<br><b>Louis:</b> Ah<br><b>Alan:</b> But corruption is illegal!<br><b>Louis:</b> James you are supporting corruption!!<br><b>James:</b> Well it makes your job as the police more important<br><b>James:</b> <span class=\"ping\">@Louis</span> Firefox has been unblocked for me. 🙂<br><b>Louis:</b> Too late, I'm a chrome user now 😋 😋<br><b>James:</b> I see<br><b>James:</b> My chromium has a threatening message so I will never use Chromium / Chrome.<br><b>Louis:</b> ahh<br>"
		},
		{
			"id": "920019122715258980",
			"last_message_id": "920053927481835560",
			"name": "Closed Ballot",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > Voting in elections is done using Cheesebot. This is so that your decision will be not be influence by who others vote for.<br><b>Louis:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "919636898350264381",
			"last_message_id": "920002338591244319",
			"name": "generally being nice to other people",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> Don't think I have to explain this one...<br><b>James:</b> Against - this is highly subjective and will be difficult to enforce.<br><b>Louis:</b> might i suggest narrowing it down to not calling people a \"piece of shit\"?<br><b>Elliot:</b> For<br><b>Elliot:</b> just don’t let people swear at people<br><b>Elliot:</b> it’s harrasment<br><b>Louis:</b> for, i agree with myself<br><b>Louis:</b> I guess this is passed <span class=\"ping\">@James</span> ?<br><b>James:</b> Passed 2-1.<br>"
		},
		{
			"id": "919152103983808553",
			"last_message_id": "919594197638611004",
			"name": "Presidential Election (11th December)",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> This is the presidential election for the term 11 December to 26 December as has been voted in the `Become a Republic` Constitutional Amendment. <br><br>The candidates are below:<br>1. Elliot Freudenburg - <span class=\"ping\">@Elliot</span> (link party leader)<br>2. Elliott Morgan - <span class=\"ping\">@Xohng Xina and De Wok</span> (link party member)<br>3. James Lindsay - <span class=\"ping\">@James</span> (Inner party leader)<br>4. Luke Twaddle - <span class=\"ping\">@Twaddle</span> (No party)<br><br>All <span class=\"ping\">@Deleted User</span>s are invited to vote. Please state the number of the candidate you wish to vote for. Your last vote (by time) as of midnight today (Saturday the 11th) will be counted. Results will be available tomorrow.<br><b>Elliot:</b> can I vote myself?<br><b>James:</b> yes<br><b>Xohng Xina and De Wok:</b> 2<br><b>James:</b> 3<br><b>Elliot:</b> 1<br><b>Louis:</b> <span class=\"ping\">@Twaddle</span> come and vote for yourself<br><b>Xohng Xina and De Wok:</b> He doesn't want to be it<br><b>Elliot:</b> wait Louis vote for me<br><b>Alan:</b> Can I vote?<br><b>James:</b> Yes<br><b>Alan:</b> 3<br><b>Alan:</b> Also surely as term and election changes was passed it should only be until the 18th <span class=\"ping\">@James</span><br><b>Louis:</b> 3<br><b>Xohng Xina and De Wok:</b> Vote for black people else ur racist<br><b>James:</b> Results:<br><b>Alan:</b> James is president!<br><b>Louis:</b> poor twaddle<br><b>Louis:</b> i don't know an elliot fredenburg<br><b>Alan:</b> <span class=\"ping\">@Elliot</span> are you still server owner?<br><b>Alan:</b> Also why is Twaddle still prime minister<br><b>Louis:</b> lol<br>"
		},
		{
			"id": "918924960003674152",
			"last_message_id": "919574576059547739",
			"name": "Entitlement to become an MP",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Everybody can become an MP and be eligible to vote on all laws (and petitions).<br><b>James:</b> For<br><b>Alan:</b> This seems a little… useless<br><b>Alan:</b> There was no law restricting who can be an MP<br><b>James:</b> But Twaddle could say that nobody can become an MP and they are all sacked, meaning that he has a dictatorship.<br><b>James:</b> This law would stop that from happening.<br><b>Alan:</b> Sure<br><b>Louis:</b> For<br><b>Elliot:</b> For<br><b>Alan:</b> For<br><b>James:</b> Passed 4-0<br>"
		},
		{
			"id": "918923613271388181",
			"last_message_id": "919574458593857607",
			"name": "Freedom of speech",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> I believe that everybody should be able to say whatever they want.<br><b>James:</b> For<br><b>Louis:</b> For<br><b>Alan:</b> For<br><b>James:</b> Passed 3-0<br>"
		},
		{
			"id": "918924299702788186",
			"last_message_id": "919574602085191701",
			"name": "Innocent until proven guilty.",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Everyone is to be believed to be innocent unless there is significant evidence that they are guilty of breaking a law.<br><b>James:</b> For<br><b>Louis:</b> For<br><b>Alan:</b> For<br><b>James:</b> Passed 3-0<br>"
		},
		{
			"id": "918581184957673532",
			"last_message_id": "919574660834787410",
			"name": "Minor Correction",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> The law “More business and NPO laws” states that the government must have a court case before shutting down a business. However, the constitution overrides this. This law proposes amending the constitution so this law is really enacted.<br><b>Alan:</b> For<br><b>Twaddle:</b> For<br><b>James:</b> For<br><b>James:</b> Passed 3-0<br>"
		},
		{
			"id": "918958776541917255",
			"last_message_id": "919575443483549759",
			"name": "Restrictions on who can be president",
			"votes": "3-for-2-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > You cannot be a bot and be president<br>> You can be independent (ie not in any political party), however only MPs who are in political parties can vote <br>> Vice prime minister renamed to Vice President <br>> You cannot be Vice President  and president at the same time.<br><b>Alan:</b> For<br><b>James:</b> For<br><b>Twaddle:</b> For<br><b>Elliot:</b> Against<br><b>Elliot:</b> i like the idea of a bot president<br><b>Louis:</b> Against I also like the idea of being a bot president<br><b>James:</b> Passed 3-2<br>"
		},
		{
			"id": "918172378289279086",
			"last_message_id": "919574184550608936",
			"name": "Term and Election Changes",
			"votes": "2-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > If #become a republic! is passed terms should be 1 week and you be able to be PM for up to two weeks in a row. Votes should be held on Saturdays as everyone should be online at some point then.<br>> Political parties may not spend more than 15cc during an election ie (Saturday) to stop the richest party from dominating all advertising channels.<br>> Laws may not be passed on Saturday<br><b>Alan:</b> Term and Election Changes<br><b>Twaddle:</b> Yep<br><b>Twaddle:</b> For<br><b>Louis:</b> Against the 1 week terms but everything else sounds nice 👍<br><b>James:</b> > Political parties may not spend more than 15cc during an election ie (Saturday) to stop the richest party from dominating all advertising channels.<br>> Laws may not be passed on Saturday<br>Against - political parties can just put up advertisements on Friday for the next day.<br><br>Stopping laws being passed is also bad as it interferes with the democratic process.<br><b>Alan:</b> Short Story Long will not display any ads in its Saturday issue, and other businesses are encouraged to do the same.<br><b>Alan:</b> For<br><b>James:</b> Passed 2-1<br>"
		},
		{
			"id": "918575621435686962",
			"last_message_id": "919573960994205717",
			"name": "Bank holidays must require a vote",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> If the government wishes to create a bank holiday, they must hold a vote in parliament.<br><b>James:</b> For<br><b>James:</b> Passed 1-0<br>"
		},
		{
			"id": "918916940867715133",
			"last_message_id": "919573837035749427",
			"name": "Ban on mis-naming yourself or your organisation",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Naming yourself or your organisation in a way that is seen as unhelpful or misleading will have a 30cc fine or a 3 day jail sentence.<br><b>James:</b> For<br><b>Alan:</b> I am in favour of this law but unfortunately cannot vote<br><b>Louis:</b> For<br><b>James:</b> Passed 2-0<br>"
		},
		{
			"id": "918923000647123005",
			"last_message_id": "919573694169350206",
			"name": "Allow political parties to advertise in short story long.",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Currently there is not much for political parties to spend money on apart from bribing members to join / stay in the party and advertising on <span class=\"ping\">#tock-tik</span>. This law would allow the political parties to also advertise in short story long.<br><b>James:</b> For<br><b>Alan:</b> I think is more of a petition thing<br><b>James:</b> No this needs to override other laws.<br><b>Alan:</b> As laws are generally more general than this<br><b>Alan:</b> Petitions can override other laws?<br><b>James:</b> There is no law that states this.<br><b>Louis:</b> For<br><b>Elliot:</b> For<br><b>James:</b> Passed 3-0<br>"
		},
		{
			"id": "918923717382406245",
			"last_message_id": "919573571930583072",
			"name": "Petitions override laws",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Petitions can override laws in edge cases. They are for specific changes rather than general ones.<br><b>James:</b> Why not just remove petitions and then make them laws.<br><b>James:</b> Against.<br><b>Alan:</b> Because if we had any non-members of parliament then they wouldn’t be able to vote!<br><b>James:</b> Well then they can just become an MP if they want to vote.<br><b>Alan:</b> What if they don’t want to<br><b>James:</b> Then they don't want to vote.,<br><b>James:</b> If they want to vote they can become an MP.<br><b>Louis:</b> I like \"corner case\" better<br><b>James:</b> This law would make petitions the same as laws<br><b>James:</b> Meaning that petitions would be redundant.<br><b>Louis:</b> ah yes<br><b>Louis:</b> what is the point of petitions anyway when we have laws<br><b>James:</b> <span class=\"ping\">@Louis</span> Vote in <span class=\"ping\">#Remove petitions</span><br><b>Twaddle:</b> Against<br><b>James:</b> Not passed 0-2.<br>"
		},
		{
			"id": "918945744336076901",
			"last_message_id": "919573399284637707",
			"name": "Remove petitions",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> I believe that petitions fulfil the same role as laws which means that they are redundant and so therefore should be removed.<br><b>James:</b> For<br><b>Louis:</b> For<br><b>Twaddle:</b> For<br><b>James:</b> Passed 2-0<br>"
		},
		{
			"id": "918948879087571045",
			"last_message_id": "919573254392410184",
			"name": "Less wealth tax",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Elliot:</b> Less wealth tax, only 3% a day as it’s a bit ridiculous<br><b>James:</b> For<br><b>Louis:</b> For<br><b>Elliot:</b> For<br><b>Xohng Xina and De Wok:</b> For<br><b>James:</b> Passed 4-0<br>"
		},
		{
			"id": "918970769768316958",
			"last_message_id": "919573163652841503",
			"name": "Replace all references to NWU with Inner party in legislation",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> All legislation that refers to a 'NWU' party (e.g. bank contract) should be amended to the 'inner party' to reflect that the party has been renamed.<br><b>Alan:</b> Make it a petition because then we do not need to wait 24 hours to vote<br><b>Alan:</b> As soon as it gets a majority it is passed.<br><b>James:</b> For<br><b>James:</b> Passed 1-0<br>"
		},
		{
			"id": "918980441191624704",
			"last_message_id": "919573055561416705",
			"name": "Bank-government contract is legally binding",
			"votes": "0-for-0-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > What the title says + the president can call a vote to replace the head of the bank.<br><b>James:</b> Law has not been passed.<br>"
		},
		{
			"id": "918559082481336340",
			"last_message_id": "918946015934054430",
			"name": "Make Bank Holidays actual bank holidays",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Xohng Xina and De Wok:</b> Basically make it so that on bank holidays, you don't get tax<br><b>Xohng Xina and De Wok:</b> Or just get rid of bank holidays completely- they are a waste<br><b>Xohng Xina and De Wok:</b> The treasury already makes profit from tax which really shouldn't be right<br><b>Xohng Xina and De Wok:</b> For<br><b>Louis:</b> Against, tax should still be collected!<br>"
		},
		{
			"id": "918578544504877106",
			"last_message_id": "918946220221820969",
			"name": "delete or archive dead channels",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> Channels that are not used anymore or are completely redundant should be deleted or archived (to preserve messages), in an archive category that it at the bottom of the channel list.<br><br>Channels that I think should be archived are<br>▫️ <span class=\"ping\">#Deleted Channel</span> <br>▫️ <span class=\"ping\">#Deleted Channel</span> <br>▫️ <span class=\"ping\">#Deleted Channel</span><br>▫️ <span class=\"ping\">#laws</span> (could just look through the <span class=\"ping\">#parliament</span> message history)<br><b>James:</b> For<br><b>Louis:</b> I'm gonna count this as passed<br><b>James:</b> <span class=\"ping\">@Twaddle</span> Please implement.<br>"
		},
		{
			"id": "917806892145856553",
			"last_message_id": "918171026528043111",
			"name": "become a republic!",
			"votes": "5-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> I think that people should only allowed to be the prime minister for 2 weeks ex. a term, after that people vote on the next prime minister and then they are in power and can choose a deputy and people who are in their \"administration\" if you like. I feel this is more democratic than the current system that we have - funny coming from a former staunch supporter of communism... Anyway, I think that this system should begin when the week ends and anyone who is wishing to run for prime minister (sounds better as president so I'll call it that from now on) can run for it. People can then vote upon who is best suited, it would be good if you can't run straight after being the \"president\". You will be able to vote for yourself as well. Also this would make for a more fun game rather than the current monopoly that the Link party has. This sounds a bit like a republic and this is good!<br><b>Twaddle:</b> Obviously I’m against but it this does get implemented it would only be fair to have the job of bank owner up for grabs as well<br><b>Xohng Xina and De Wok:</b> For<br><b>Xohng Xina and De Wok:</b> Ra ra rasputin<br><b>Louis:</b> for<br><b>Louis:</b> could other people express an opinion?<br><b>Alan:</b> For<br><b>Twaddle:</b> Alan you literally only wanted this to be a constitutional matter so you could vote<br><b>Alan:</b> No<br><b>Alan:</b> Otherwise it would be pointless as laws cannot override the constitution and this contradicts the current constitution<br><b>Twaddle:</b> <span class=\"ping\">@Elliot</span> come vote<br><b>Twaddle:</b> Of course you do not have to vote for what I want<br><b>Elliot:</b> wait so<br><b>Elliot:</b> can you be pm for several terms in a row<br><b>Twaddle:</b> Only 2<br><b>Elliot:</b> For<br><b>Twaddle:</b> Actually no apparently<br><b>Elliot:</b> But put this in the constitution<br><b>Twaddle:</b> I re read the thing<br><b>Twaddle:</b> Only 1<br><b>Louis:</b> You cannot be president for more that 1 term in a row, a term being 2 weeks<br>"
		},
		{
			"id": "917459509851594753",
			"last_message_id": "917479246459449414",
			"name": "More NPO or business laws",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > When a channel is created, the owner must have control over the name & description. This is to prevent the PM from deliberately preventing businesses for making money, for example he is clearly against short story long as he renamed it to “stupid” when this was not requested giving other companies an unfair advantage defeating the purpose of the free market)<br>> Government cannot use other means to stop companies from making money as long as this is legal.<br>> The government may sue a business or NPO if they deem it to be improper, but not if it is deemed unnecessary.<br>> If the government wish to shut down a business or NPO they must take it to court<br><b>James:</b> For<br><b>Elliot:</b> For<br>"
		},
		{
			"id": "917443685224972358",
			"last_message_id": "917470844278673408",
			"name": "GEMP ammendment",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Ideas by Elliott:<br><br>• Transaction tax should be 5% <br>• Wealth tax should be 20% per week<br>• MP roll call should increase by 10% for every day you claim it, starting at 1cc. So eg starts at 1cc, then 1.1cc 1.21cc etc.<br><b>Alan:</b> Capped at 5cc<br><b>Louis:</b> Cheese-bot should have an allotted time to be online so some of these can be met<br><b>Alan:</b> Mmm<br><b>Twaddle:</b> For<br><b>James:</b> Against - I believe that bonuses for streaks of 4cc (400% of what some people might earn if for whatever reason they miss a day) is extremly unfair.<br><b>James:</b> However if you want to change the other things you can propose other laws.<br><b>Xohng Xina and De Wok:</b> For<br><b>Xohng Xina and De Wok:</b> Ur still not an MP<br><b>James:</b> I am<br><b>James:</b> In fact I am head of the NWU party.<br><b>Xohng Xina and De Wok:</b> So your the head of the political party of people who aren't supposed to be political<br><b>James:</b> We are neutral on if we think that the current prime minister is sane or not.<br><b>James:</b> However we can still vote on laws.<br><b>Louis:</b> I don't mind wealth tax being applied per-week but I do agree with James that streaks are unfair<br><b>James:</b> But wealth tax is currently 30.1662704% per week. Do you really want to lower it? Think what this will mean for the treasury.<br><b>Louis:</b> but 20 is a nice round number and 30.16 blah blah blah is a horrible strange number<br><b>Louis:</b> i think it should be at 28% per week becuz 28 is a perfect number<br><b>Alan:</b> True<br><b>James:</b> But 1−.95^7 is a better number in my opinion.<br><b>Xohng Xina and De Wok:</b> No 20 gud 28 bads<br>"
		},
		{
			"id": "917457829911228536",
			"last_message_id": "917466152790269963",
			"name": "Petitions",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Anyone can propose a petition, if more than half of the population sign it must be recognised by The Prime Minister. (This is not for things you would propose as a law, but for cases like <span class=\"ping\">#gladvertising</span>)<br><b>Alan:</b> I edited “Twaddle” to “The Prime Minister”<br><b>Alan:</b> To sign a petition say “I agree”<br><b>James:</b> For<br><b>Xohng Xina and De Wok:</b> For<br><b>Louis:</b> I want it to be 2/3 of the population<br><b>James:</b> No - under this law the prime minister just has to state that the petition exists but that nothing will come of it once 1/2 of the population sign it. This surly isn't too strict?<br><b>Louis:</b> I misinterpreted what Alan said, I thought it meant that half the people <i>that voted or expressed an opinion</i><br><b>James:</b> > more than half of the population sign it <br>..........<br><b>James:</b> That is very clear.#<br><b>Louis:</b> I'm not disputing that!!<br>"
		},
		{
			"id": "917806144188219413",
			"last_message_id": "917822892559978567",
			"name": "become a republic!",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> I think that people should only allowed to be the prime minister for 2 weeks ex. a term, after that people vote on the next prime minister and then they are in power and can choose a deputy and people who are in their \"administration\" if you like. I feel this is more democratic than the current system that we have - funny coming from a former staunch supporter of communism... Anyway, I think that this system should begin when the week ends and anyone who is wishing to run for prime minister (sounds better as president so I'll call it that from now on) can run for it. People can then vote upon who is best suited, it would be good if you can't run straight after being the \"president\". You will be able to vote for yourself as well. Also this would make for a more fun game rather than the current monopoly that the Link party has. This sounds a bit like a republic and this is good!<br><b>Louis:</b> Alan says that this should go in <span class=\"ping\">#constitution</span> so I'm going to archive this<br><b>James:</b> Communism was democratic.<br>"
		},
		{
			"id": "916015310472114256",
			"last_message_id": "916248802460069888",
			"name": "Illegal to delete laws",
			"votes": "3-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> This law proposes it will be illegal to delete laws (i.e. threads or law posts in <span class=\"ping\">#laws</span>. Punishment will be upwards of 15cc or a 5 day stay in prison.<br><br>Please vote \"For\" or \"Against\" below.<br><b>Louis:</b> For<br><b>Elliot:</b> For<br><b>Elliot:</b> but you can vote for them to be overruled by new laws<br><b>Elliot:</b> right?<br><b>Louis:</b> This is making it illegal to delete the thread itself<br><b>Twaddle:</b> For<br>"
		},
		{
			"id": "916015728392548432",
			"last_message_id": "916248735422488586",
			"name": "Cannot claim MP pay in prison",
			"votes": "3-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Under this law, MPs that are jailed will no longer be able to receive pay. If you want CheeseBot to enforce this this will be 5cc to Go Consulting.<br><br>Please vote \"For\" or \"Against\" below.<br><b>Louis:</b> For<br><b>Xohng Xina and De Wok:</b> For but why is this needed is anyone gonna get prisoned<br><b>Louis:</b> <i>if</i><br><b>Twaddle:</b> For<br>"
		},
		{
			"id": "916035705979949076",
			"last_message_id": "916064897077497887",
			"name": "Vice PM Not To Be Paid Extra",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Elliot Freudenburg wants to keep 3cc pay instead of the standard 2cc MP pay.<br><br>The vice-PM has currently done nothing with their role. Whilst they were in power for a day they achieved nothing. I urge you to consider if this is a good use of the tax payer's money. This pay increase can obviously be re-proposed in future if it becomes clear that the vice-PM is doing something for the country.<br><br>Please vote \"For\" if you want to reduce the vice-PMs pay back to 2cc or \"against\" if you think that the services proviced by the Vice-PM are worth 7cc per week<br><b>Elliot:</b> this was already a law<br><b>Elliot:</b> we voted for this<br><b>James:</b> where?<br><b>Elliot:</b> im trying to find<br><b>Elliot:</b> i found the law<br><b>Elliot:</b> but not the thread<br><b>Elliot:</b> i cant find<br><b>Elliot:</b> this was the law:<br><b>Elliot:</b> I propose a law where:<br>because we are not a communist country, people are payed differently dependant on how they really work. The prime minister should be payed 4 cheesecoin, and the vice prime minister should get 3. I know this law may currently seem bias, but I plan to give a lot of money away to invest into the economy by paying some businesses so that they may grow (Short-story-long and official-police are a couple of my main targets). please consider voting for so that when you get a go in power you get more money<br><b>Elliot:</b> and elliot and twaddle voted for it<br><b>Elliot:</b> see if they remember<br><b>Elliot:</b> also louis voted foor<br><b>James:</b> Vice PM Not To Be Paid Extra<br><b>Louis:</b> i don't think i voted<br><b>Elliot:</b> you did<br><b>James:</b> I have updated the law.<br><b>Elliot:</b> i said: \"i think link will be in [pwer soon\"<br><b>Elliot:</b> and you said \"for this reason i vote\"<br><b>Louis:</b> is this in the <span class=\"ping\">#vice prime minister</span> thread?<br><b>Elliot:</b> nein<br><b>Louis:</b> oh, where then?<br><b>Alan:</b> It was deleted by Elliott<br><b>Xohng Xina and De Wok:</b> For<br><b>Xohng Xina and De Wok:</b> Axe dent<br><b>James:</b> You want the vice-PM not to be paid extra?<br><b>Xohng Xina and De Wok:</b> Yes<br><b>Elliot:</b> oh maybe!<br><b>Elliot:</b> anyway<br><b>Elliot:</b> against<br><b>James:</b> For<br>"
		},
		{
			"id": "916027497710239824",
			"last_message_id": "916394860766965770",
			"name": "Business requests",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> Business requests should always be approved (applies to non-profits as well) unless there is a good reason not to e.g. making loads of organisations randomly. People doing this will be prosecuted and probably sent to jail if they're proven guilty.<br><b>Elliot:</b> For<br><b>Louis:</b> Business requests<br><b>Twaddle:</b> I have seen this and chosen not to vote<br><b>Twaddle:</b> I’m not neglecting my responsibility to vote<br><b>Louis:</b> i guess this is passed since it has been around for 24 hours<br><b>Alan:</b> No it has to archive<br><b>Louis:</b> alrighty<br>"
		},
		{
			"id": "916014783667527680",
			"last_message_id": "916035828000645130",
			"name": "Reinstate Different pays",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Normal MPs will still be payed 2cc per day if they are willing to claim it from the CheeseBot, but the PM will be able to claim 4cc per day. The head of the bank and the head of the police will be able to claim 3cc per day.<br><br>This is slightly different from the original law because of slightly decreased rates and no extra pay for the vice-PM. I think this is better due to more equality. <br><br>Vote 'For' or 'Against' now!<br><b>Louis:</b> For this<br><b>Louis:</b> (becuz i gets more chezcoins)<br><b>Alan:</b> (Before this Twaddle payed you 5)<br><b>Louis:</b> Never mind, I still get payed by Go Consulting<br><b>James:</b> But the different pay has been deleted so everyone is currently paid 2 cheesecoins per day.<br><b>Elliot:</b> For<br><b>Elliot:</b> but<br><b>Elliot:</b> there was a law in which vice pm was payed 3cc a day!<br><b>James:</b> The vice PM does not do anything.<br><b>Elliot:</b> still<br><b>Elliot:</b> its a law!<br><b>Elliot:</b> also yes they do<br><b>Elliot:</b> they organise the pm<br><b>James:</b> It has been deleted<br><b>Elliot:</b> they act upon the behalf of the pm when they are away<br><b>Elliot:</b> and they will probably get more perks soon<br><b>James:</b> well they don't do anything currently - even when the PM is off.<br><b>James:</b> For<br><b>Alan:</b> <span class=\"ping\">@Twaddle</span> is technically breaking the law by not having given <span class=\"ping\">@Elliot</span> extra privileges<br><b>James:</b> Vice prime minister law didn't get passed, I voted against and Elliott M voted for.<br><b>Elliot:</b> and i voted for and twaddle voted for<br><b>Elliot:</b> wait i cannot find twaddle voting for it<br><b>James:</b> No they didn't<br><b>Elliot:</b> but i voted for<br><b>Elliot:</b> i voted for<br><b>Elliot:</b> by creating it<br><b>James:</b> No you didn't - you never said For.<br><b>Elliot:</b> i think that i automatically voted for it by creating it<br><b>Elliot:</b> <br><b>Elliot:</b> back then that was how it worked<br><b>Alan:</b> Before Voting Procedure was passed voting was very.. vague like that, if Elliot knew then he would have voted for it<br><b>Elliot:</b> yes<br><b>Elliot:</b> also i forgot to put the law in the laws section<br><b>Elliot:</b> oopsie<br><b>James:</b> <span class=\"ping\">@Elliot</span> <span class=\"ping\">#Vice PM Not To Be Paid Extra</span><br>"
		},
		{
			"id": "910944875724275722",
			"last_message_id": "916036839633215509",
			"name": "vice prime minister",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Elliot:</b> a vice prime minister should be selected by the prime minister and should have administrator level commands on discord<br><b>Elliot:</b> (its that simple)<br><b>Elliot:</b> please say yes<br><b>James:</b> This seems completely unnecessary and will lead to much confusion. Against.<br><b>Elliot:</b> but... its simple<br><b>Louis:</b> usually we have a vice prime minister if the current one has an... accident, i'm not sure this is much of a danger in this case<br><b>Xohng Xina and De Wok:</b> I vote for it<br><b>Xohng Xina and De Wok:</b> No doubt Twaddle will never choose me but I know from experiance that another person working on server issues would be very helpful<br><b>Louis:</b> <span class=\"ping\">@Elliot</span><br><b>Elliot:</b> yeah<br><b>Elliot:</b> this went throguh<br>"
		},
		{
			"id": "915275927573893160",
			"last_message_id": "915327431181729832",
			"name": "Constitutional Amendment no.1",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > No tax evasion (even though it is basically impossible with cheesebot)<br>> No money laundering <br>> You must pay employees at least 2cc a week<br><b>Alan:</b> For<br><b>Louis:</b> Why 2 cheesecoins?<br><b>Alan:</b> Why not?<br><b>Elliot:</b> For<br><b>Louis:</b> For<br><b>Louis:</b> ~~Im all for money laundering~~<br>"
		},
		{
			"id": "914941629742317588",
			"last_message_id": "915303888486285363",
			"name": "Debt Laws",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> > If you take a loan from the bank and do not repay it within a week you can be imprisoned or (for <10cc loans) be blocked from paying money to anywhere but the bank.<br>> Failure to pay court fines within 24 hours leads to automatic imprisonment until you agree to pay said loan<br>> You can obviously get free money from the Less Debt fund if you send proof from CheeseBot that you are in debt<br><br>Of course the laws would mean CheeseBot would have to implement some more commands so I offer 5cc to <span class=\"ping\">#go-consulting</span> if the law is passed<br><b>James:</b> Does imprisonment lead to the debt being written off?<br><b>Alan:</b> <span class=\"ping\">@James</span> It’s like the one with failure to pay court fines. If they agree but then don’t pay for 6 hours then they are back in prison<br><b>Elliot:</b> yes sure<br><b>Alan:</b> <span class=\"ping\">@Elliot</span> Is that for<br><b>Alan:</b> Under new laws you must say “for” or “against” to vote<br><b>Elliot:</b> oh ok<br><b>Elliot:</b> for<br>"
		},
		{
			"id": "913864460052086824",
			"last_message_id": "913891753977843722",
			"name": "dfm.live laws",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> If you get more than 3 questions wrong in dfm.live then you will be fined 5 cheesecoins. This is to punish people for \"being a disgrace\" as our pm put it.<br><b>James:</b> What if the person cannot afford this?<br><b>Louis:</b> Then they can be put in debt to the country<br><b>James:</b> who takes on the debt?<br><b>James:</b> Is there any interest?<br><b>James:</b> Is there any liability? (e.g. taking away your house if you cannot pay your debt)<br><b>Louis:</b> \"takes on\"?<br><b>James:</b> i.e. who pays you so you can pay the treasury 5 cheesecoins?<br><b>Louis:</b> Not sure<br><b>Xohng Xina and De Wok:</b> No that would be too unfair on luke as he would be miles in debt<br><b>Louis:</b> He should get better at drfrost then<br><b>Xohng Xina and De Wok:</b> Yes but he is so dumb he couldn't even do the green sheet correct<br><b>Elliot:</b> yes<br><b>Elliot:</b> and if you get all questions right the bank should give you 3 cheesecoin for being a credit to the country<br><b>Twaddle:</b> For<br><b>Xohng Xina and De Wok:</b> Why<br>"
		},
		{
			"id": "913841725385084998",
			"last_message_id": "913864190920364071",
			"name": "Voting procedure",
			"votes": "4-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> You may only vote once in a thread<br><b>Twaddle:</b> You must say the exact word “For” or “Against” when you vote (however any capitalisation is fine)<br><b>James:</b> For<br><b>Elliot:</b> fororororrarroro<br><b>Xohng Xina and De Wok:</b> For<br><b>Louis:</b> For<br>"
		},
		{
			"id": "913842251568926740",
			"last_message_id": "913864225573703690",
			"name": "New laws override old laws except for the constitution",
			"votes": "5-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> This law would mean that in the case where multiple laws covered the same ground, the newest law (by date) is applied. The only exception to this is the laws in <span class=\"ping\">#constitution</span>, which always have a priority.<br><b>James:</b> I'm for this<br><b>Elliot:</b> for<br><b>Xohng Xina and De Wok:</b> For<br><b>Twaddle:</b> For<br><b>Louis:</b> for<br>"
		},
		{
			"id": "912796157204389908",
			"last_message_id": "913864284356870145",
			"name": "Emergency protocol",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Any MP may call emergency protocol. In emergency protocol a law may be created or removed without the necessary 24 hour period of inactivity if over half the MPs agree. However after this emergency protocol has been passed or failed MPs vote on if the situation was called appropriately with the normal 24 hours of inactivity needed. If the situation was deemed inappropriately called then the MP will be taken to court by the state.<br><b>Alan:</b> But… if half the MPs think it is bad then they can just vote against it and there is no way that vote can get through then<br><b>Twaddle:</b> This is for more urgent matters, such as something that could properly mess up the country if left for too long<br><b>Alan:</b> But if they all just quickly voted…<br><b>Twaddle:</b> But there is still the 24 hour wait after all communication has stopped<br><b>Twaddle:</b> Also most likely this is going to be used to stop someone who has discovered something that could deviate the country and they could just keep messaging and keep the thread open<br><b>Twaddle:</b> <i>devistate<br><b>Alan:</b> Well the law is passed if there is an actual majority<br><b>Twaddle:</b> Unfortunately as is written in the constitution that is not how it works right now<br><b>Twaddle:</b> Also what if it is an exploit such as elliotts recent example that allows him around the voting system<br><b>Xohng Xina and De Wok:</b> Against<br><b>Twaddle:</b> For<br><b>Twaddle:</b> (Obviously)<br><b>Xohng Xina and De Wok:</b> Ironic<br><b>Twaddle:</b> You are one to talk, you voted for yourself 18 times<br><b>Xohng Xina and De Wok:</b> Again<br><b>Xohng Xina and De Wok:</b> Wow<br><b>Xohng Xina and De Wok:</b> Hmm<br><b>Xohng Xina and De Wok:</b> Well<br><b>Xohng Xina and De Wok:</b> M<br>"
		},
		{
			"id": "912371114095816736",
			"last_message_id": "913864238391504916",
			"name": "More stuff",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> You should not be able to vote more than once<br><b>Twaddle:</b> Only MPs may propose and vote upon laws<br><b>Twaddle:</b> We shall hold this open until we think we have everything vital<br><b>Twaddle:</b> You may only be a part of one political party at a time<br><b>Alan:</b> Who deleted my messages<br><b>Alan:</b> Please put them back<br><b>Twaddle:</b> Me because they are not relevant here<br><b>Twaddle:</b> I got the message thought<br><b>Twaddle:</b> <i>though<br><b>Xohng Xina and De Wok:</b> Yh shouldn't be able to vote twice<br><b>Xohng Xina and De Wok:</b> For<br><b>Xohng Xina and De Wok:</b> I don't see why last one is useful as no one is<br><b>Twaddle:</b> No joke/fake laws<br><b>Xohng Xina and De Wok:</b> Nah<br><b>Xohng Xina and De Wok:</b> Can't add that after starting vote<br><b>Xohng Xina and De Wok:</b> U should make another thread<br><b>Twaddle:</b> This<br><b>Twaddle:</b> Basically I meant don’t vote yet<br><b>Xohng Xina and De Wok:</b> Ohs<br><b>Xohng Xina and De Wok:</b> When can we vote<br><b>Twaddle:</b> When I have everything I want<br><b>Twaddle:</b> Actually I should probably close this thread and just write them down until I propose it<br><b>Xohng Xina and De Wok:</b> K<br><b>Alan:</b> From Elliott 👑 : Hmmm can we vote?<br><b>Twaddle:</b> No I’m just listing more stuff I think nessesary<br><b>Twaddle:</b> Then we will vote<br><b>Alan:</b> Oh yes I had one<br><b>Alan:</b> I can’t remember what it was<br><b>Xohng Xina and De Wok:</b> K<br><b>Xohng Xina and De Wok:</b> I feel like not much is happening here<br><b>Alan:</b> What about thrice?<br><b>Xohng Xina and De Wok:</b> Hmmmmmm<br><b>Xohng Xina and De Wok:</b> M<br>"
		},
		{
			"id": "912384888873836574",
			"last_message_id": "912397866255921162",
			"name": "woo Ellot in Powa",
			"votes": "2-for-2-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Xohng Xina and De Wok:</b> Dis real smarts so u shud vot for<br><b>Xohng Xina and De Wok:</b> Basclly Elliott Morgan Has ALL power of serva and stuf<br><b>Xohng Xina and De Wok:</b> No need for any1 else to vote and stufs<br><b>Xohng Xina and De Wok:</b> So yes voteeeee for<br><b>Xohng Xina and De Wok:</b> Me is for<br><b>Xohng Xina and De Wok:</b> this goodds for u<br><b>Xohng Xina and De Wok:</b> U shud vot for<br><b>Xohng Xina and De Wok:</b> Evwy one vote for<br><b>Xohng Xina and De Wok:</b> I vote for<br><b>Xohng Xina and De Wok:</b> Also no mor partyyys to vote for only Elliott<br><b>Xohng Xina and De Wok:</b> And ellotttt dont need to vote for stufs or have others vote for tings dey just happenss<br><b>Alan:</b> Against<br><b>Xohng Xina and De Wok:</b> + peeps shudnt chanj serva for da reason dat it not goods<br><b>Twaddle:</b> Against<br><b>Xohng Xina and De Wok:</b> Woo dis back so everyone vote for<br><b>Twaddle:</b> Please for gods sake no<br><b>Twaddle:</b> He will literally use a joke to get in power<br><b>Twaddle:</b> Please do not<br><b>Xohng Xina and De Wok:</b> Wut<br><b>Xohng Xina and De Wok:</b> Y not vote for<br><b>Xohng Xina and De Wok:</b> U shud vote for<br><b>Xohng Xina and De Wok:</b> I vote for<br><b>Xohng Xina and De Wok:</b> Come ons gys u shud vote for cuz: me gud, twad bad and my dog cute so dat make me gud leader like a certain german leader with a dog<br><b>Elliot:</b> against<br><b>Elliot:</b> twad no bad<br><b>Elliot:</b> elytt is bad and elyt is good ok<br><b>Xohng Xina and De Wok:</b> Bof gud do<br><b>Xohng Xina and De Wok:</b> Bof elyt/tts gud<br><b>Xohng Xina and De Wok:</b> I suppppppooopppppurts elyt equalllytyyy<br>"
		},
		{
			"id": "911683831847845928",
			"last_message_id": "912085621806334033",
			"name": "No wealth tax for NPOs",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Title says all<br><b>Alan:</b> No wealth tax for NPOs<br><b>Xohng Xina and De Wok:</b> For<br><b>Twaddle:</b> I am against with the same reasoning as James<br><b>Twaddle:</b> Also what is an NPO?<br><b>James:</b> Non profit organisation<br><b>Xohng Xina and De Wok:</b> So u vote without knowing what u r voting for<br><b>Twaddle:</b> I believe that tax should apply on everything and no-one should be excepted from it<br><b>Xohng Xina and De Wok:</b> Interesting to tax those who make no profit and so basically take money from jobless<br><b>Xohng Xina and De Wok:</b> For having too much<br>"
		},
		{
			"id": "911684420157734943",
			"last_message_id": "911940705398685707",
			"name": "Neutral Mediator in case of draw",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> A neutral mediator from the NWU should decide whether or not a bill is passed in event of a draw<br><b>James:</b> Against - a bill should not be passed if there is not a majority.<br><b>Louis:</b> Am I allowed to vote?<br><b>Xohng Xina and De Wok:</b> For<br>"
		},
		{
			"id": "910584897230475315",
			"last_message_id": "910587319810150512",
			"name": "GLUMP",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> GLUMP<br>Grand Legal Unique Master Plan<br>1. You may only take someone to court for a broken law<br>2. You may hire a barrister (a lawyer) to help you but you must pay them a minimum of 1 cheesecoin<br>3. The defence and prosecution must both agree on a judge they believe neural in writing on the discord server. In the event this does not happen there will be a trio of judges that act as one consisting a neutral worker(decided among the neutral workers), the person chosen by the prosecution and a person chosen by the defence. All Judges must promise to be fair, just and to not lie in court.<br>4. The jury consists of all willing people who are not directly involved in the case (eg not lawyers, Judges, prosecution or defence), they must vote among themselves and come to a conclusion.<br>5. It is recommended the judge agree with the jury but in the event of a disagreement between the Judge and Jury a coin shall be flipped.<br>6. Judges and members of the jury must take all evidence and speeches into account and put all personal feelings away<br>7. Louis, head of the police is on the lookout for crimes and will therefore prosecute anyone who he believes has broken the law<br>8. Prison means being muted on discord for a maximum of 5 days<br>9. Punishment may include: Prison, Payments to Prosecution or Defence, and community service (ie helping Alan with the bank calculations)<br>10. I’m the case of an official position going to jail, another person who works under them may take their jo<br>11. If you have been to prison in the last 5 days you may not be on the jury, if you have been to prison in the last ten days you may not be a judge<br>edit:<br>12. If there is disagreement on what a law entails you may also go to court to settle the matter without any type of punishment for losing<br><b>Twaddle:</b> I acknowledge there may be some flaws with this and implore you to point them out so I may change it<br><b>Twaddle:</b> Just be aware if you agree there is a good chance a bit of it will be changed from how it is now<br><b>Twaddle:</b> @here<br><b>Louis:</b> I am strongly in favour of a reform to the legal system<br>"
		},
		{
			"id": "910578105318522930",
			"last_message_id": "910581821174071357",
			"name": "De Facto Constitution Formalisation",
			"votes": "1-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> I would like to formalise some laws that are basically followed in New New Cheeseland, but have yet to be formalised. They should all seem pretty simple. Also note that I am not voting on this and do not in any way support it.<br><br>(This will go in <span class=\"ping\">#constitution</span> if voted in)<br><br>> You must be in a political party to vote.<br>> A political party must have at least two members<br>> The Prime Minister will always be server owner. You must hand over server ownership.<br>> If you wish to propose a new law create a thread in <span class=\"ping\">#parliament</span> . Voting ends when the thread is archived (after 24 hours of inactivity)<br>> You may not create additional bank accounts if you do not have a political party / NPO / business <br>> The party with the most members is in power. If two parties are tied they form a coalition government<br>> You may not gift negative numbers of Cheesecoin. <br>> No stealing Cheesecoin or anything worth Cheesecoin. <br>> No blackmail.<br>> The government may shut down any business they deem to be illegal.<br>> The bank may change its interest rates at its own discretion.<br><b>Twaddle:</b> Yep<br><b>Xohng Xina and De Wok:</b> Sure except the government should still be allowed to overule the bank<br><b>Louis:</b> I might want to add that corruption should not be allowed, as the definition of corruption might become a bit woolly, I will say that corruption is interfering with the processes the third cheeselandic republic to benefit your cause.<br>"
		},
		{
			"id": "910576491354550312",
			"last_message_id": "910576794804052020",
			"name": "Deleting messages that are important should be illegal",
			"votes": "0-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> The name says what I want<br><b>Twaddle:</b> Deleting messages that are important should be illegal<br><b>James:</b> Against as this would be very hard to enforce.<br><b>Twaddle:</b> It’s very infuriating that elliott is deleting my messages<br><b>Twaddle:</b> I want it to stop<br>"
		},
		{
			"id": "910280704749871155",
			"last_message_id": "910572090053259324",
			"name": "Public declaration of Party Affiliation",
			"votes": "3-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>James:</b> Under this new law MPs must publicly declare which political party they are in / supporting. This would most probably prevent much confusion, corruption and trickery, making New New Cheeseland a better place.<br><b>Twaddle:</b> Good idea<br><b>Twaddle:</b> I vote for<br><b>Louis:</b> I vote for too<br><b>James:</b> for<br>"
		},
		{
			"id": "909850750983757824",
			"last_message_id": "910581233296220190",
			"name": "Relieving Twaddle of political duties",
			"votes": "5-for-2-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Here you can vote on whether or not Twaddle shall be permitted to vote, speak, or propose laws in <span class=\"ping\">#parliament</span> .<br><b>Xohng Xina and De Wok:</b> I vote for<br><b>Twaddle:</b> <span class=\"ping\">@Alan</span> would you please clarify for me if for means you would like to ban me or not<br><b>Twaddle:</b> I’m just a bit confused because I think it might have been the other way round last time<br><b>Xohng Xina and De Wok:</b> Shall I present my arguement<br><b>Alan:</b> Basically you will not be able to see <span class=\"ping\">#parliament</span><br><b>Twaddle:</b> No I mean does saying yes mean you vote for me to get banned or not<br><b>Twaddle:</b> <span class=\"ping\">@Alan</span><br><b>Alan:</b> I you vote for then you are voting to ban <span class=\"ping\">@Twaddle</span><br><b>Twaddle:</b> Ok so I vote to not ban me<br><b>Xohng Xina and De Wok:</b> Please read the following before making a vote in this thread:<br><br>I believe that Luke Twaddle should not be associated with political issues in the country because he is so adament to deconstruct the nation like he has done many times before. Please understand that if it were not for his history of misdeeds i would not vote for this regardless of my opinions on his character. I only do so for the greater good.<br><br>What is the point of this nation, of this server? Well i believe it was created for some fun and entertainment- something to pass away boring school days and escape the harrowing reality we live in today. Unfortunately Luke does not quite understand that. Does not understand the strange realness of this creation. Does not understand the rest of us and only wishes for destruction and chaos. He literally admitted it immediately to us all. I believe that for the greater good and enjoyment of the nation, Twaddle should step down from the politics of the server. This does not mean he is not a part of it or has any less right than anyone else. It simply balances the server out and restores democracy.<br><br>When I refer to \"the greater good\" i simply mean that following previous cheeseland establishments, Twaddle has proven himself to be disruptive politically and ruining enjoyment for everybody else by taking the nation down. It is not harsh to relieve him of political duties so that everyone, including himself, can enjoy themselves.<br><b>Xohng Xina and De Wok:</b> So with this in mind, i now invite all to partake in this vote. I invite those who initially thought against to reconsider. To amend their rigidness and stubborness so they can be more liberal and open minded. I even invite Twaddle himself to rethink. Do you really want to cause chaos and disruption in your own selfish enjoyment or let the flow of the server continue? Why are you doing this? Just to spite me, just to annoy everyone, just to be \"the best and most powerful\". Maybe you might even want to step down. Maybe you may prefer to focus on your business. Maybe you really don't want to have to sort out all the struggles and stresses on the server and burden yourself with the problems of others when you cannot sort out your own ones.<br><b>Twaddle:</b> I have reformed but feel free to believe this as it was once true and I may not be able to change<br><b>Xohng Xina and De Wok:</b> Relieving Twaddle of political duties<br><b>Louis:</b> I think that it is unfair to bar from being able to participate in this game we have made just for playing it.<br><b>Xohng Xina and De Wok:</b> But its not stopping him from playing<br><b>Xohng Xina and De Wok:</b> Twaddle has his own business<br><b>Xohng Xina and De Wok:</b> He still gets a vote<br><b>Xohng Xina and De Wok:</b> And he can do whatever other stuff he likes<br><b>Louis:</b> Ah but it is anti-bullying week<br><b>Xohng Xina and De Wok:</b> Yeah but twaddle didn't wear odd socks<br><b>Louis:</b> You have got me cornered, I have nowhere to run, I did not wear odd socks either<br><b>Xohng Xina and De Wok:</b> Hmmmmmmmmm<br><b>Louis:</b> I feel pretty annoyed that my joke has continued for so long :(<br><b>Twaddle:</b> I did<br><b>Louis:</b> oh no<br><b>Twaddle:</b> Also Louis it would be good if you could vote because I think you forgot<br><b>Twaddle:</b> <span class=\"ping\">@Louis</span><br><b>Louis:</b> twaddle should get the vote<br><b>Twaddle:</b> Thanks<br><b>Xohng Xina and De Wok:</b> Cameron and Harry vote to ban Twaddle<br><b>Xohng Xina and De Wok:</b> This voting was through discord and so does count<br><b>Louis:</b> I don't think they are in this server<br><b>Xohng Xina and De Wok:</b> They are<br><b>Xohng Xina and De Wok:</b> They are the general public<br><b>Xohng Xina and De Wok:</b> Of the server<br><b>Xohng Xina and De Wok:</b> They may not be MPs anymore but they can still vote<br><b>Louis:</b> I mean, are they actually in this discord server<br><b>Twaddle:</b> Umm no<br><b>Twaddle:</b> Non MPs cannot vote<br><b>Xohng Xina and De Wok:</b> Isn't it so ironic how your defending his right to vote so that he can stop many others from voting<br><b>Xohng Xina and De Wok:</b> Your proof is where<br><b>Twaddle:</b> This is pretty well documented<br><b>Twaddle:</b> I’m not the one who made this rule<br><b>Xohng Xina and De Wok:</b> They sent a message<br><b>Xohng Xina and De Wok:</b> Where is it then<br><b>Twaddle:</b> I cannot find it as my laws channel has been cleared<br><b>Twaddle:</b> Proof<br><b>Twaddle:</b> But I shall as <span class=\"ping\">@Alan</span> if he can find it<br><b>Xohng Xina and De Wok:</b> Charge your phobe<br><b>Xohng Xina and De Wok:</b> Phone<br><b>Twaddle:</b> <i>ask<br><b>Alan:</b> Cameron and Harry cannot vote as they are not on the discord<br><b>Alan:</b> I cannot send photos in threads but I can confirm that <span class=\"ping\">#laws</span> has been cleared<br><b>Alan:</b> The wording of the law Twaddle proposed was “Discord-only MPs and voting”.<br><b>Xohng Xina and De Wok:</b> Hm<br><b>Xohng Xina and De Wok:</b> M<br><b>Chino:</b> I vote for Twaddle to be banned<br><b>Louis:</b> <span class=\"ping\">@Elliot</span> please vote 🙏<br><b>Elliot:</b> For or against?<br><b>Elliot:</b> <span class=\"ping\">@Louis</span><br><b>Elliot:</b> sure<br><b>Deleted User:</b> ive been told to say the following:<br>I vote for Twaddle to be banned<br><b>Xohng Xina and De Wok:</b> Nice<br><b>Xohng Xina and De Wok:</b> Is that for or against<br><b>Xohng Xina and De Wok:</b> Hmm sounds like a yes<br><b>Twaddle:</b> Can we please just confirm Elliot was on my side before message deletions<br><b>Louis:</b> As I proposed this originally, I wish for this to be withdrawn.<br><b>Louis:</b> Elliott, please could you not delete messages here and get rid of the context<br>"
		},
		{
			"id": "909851012641214525",
			"last_message_id": "909854841403219968",
			"name": "Party changing restrictions",
			"votes": "4-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Here you vote on the bill proposed by <span class=\"ping\">@Louis</span> :<br><br>I want a restriction on how often you can change which party you are affiliated with - of course you can be not affiliated with a party at any time you want, but perhaps a sane limit to keep the power dynamics from shifting so dramatically? Perhaps one party per day per person is reasonable, if anyone has a better idea (hopefully more strict!) then please do suggest in the thread. I hope that this will be able to curb the (too) fast changes in who has power and make it possible for people who are in power to actually implement things instead of being kicked out.<br><b>Xohng Xina and De Wok:</b> I also vote for<br><b>Louis:</b> I vote for this<br><b>Twaddle:</b> I vote for<br>"
		},
		{
			"id": "908780997271748658",
			"last_message_id": "909835765855453257",
			"name": "Discord only MP and voting",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> I believe that only people on the discord should be allowed to be MPs and vote, this would not just apply to new members, it would also apply to current members<br><b>Louis:</b> I agree (like before)<br><b>Xohng Xina and De Wok:</b> I disagree on conditions that I would agree tho trying to sort out current members would be complicated and unfair on those who were not previously aware<br><b>Louis:</b> (quite a few of elliott's party members are not on discord)<br><b>Xohng Xina and De Wok:</b> And it would be unfair to make them have to join when it wasn't a previous requirement<br><b>Xohng Xina and De Wok:</b> It's like signing up to a free subscription then finding out that you have to pay £100 each month<br><b>Twaddle:</b> Forgot to say I agree<br><b>Twaddle:</b> (With myself and not Elliott)<br><b>Louis:</b> It does make the voting system a little easier<br><b>Twaddle:</b> <span class=\"ping\">@James</span><br><b>Twaddle:</b> <span class=\"ping\">@Elliot</span><br><b>Twaddle:</b> <span class=\"ping\">@Chino</span><br><b>Twaddle:</b> Please come make a decision<br><b>Elliot:</b> Yep I think we should<br><b>James:</b> But discord is free and it takes minutes to sign up.<br><b>James:</b> I am strongly in favour.<br><b>Xohng Xina and De Wok:</b> .<br><b>Alan:</b> Just keeping this unarchived so we can ‘investigate’<br>"
		},
		{
			"id": "932668020785053726",
			"last_message_id": "932675701327409182",
			"name": "Our political situation",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Our political situation is a bit weird the only reason we have a prime minister and a president is purely because Alan wanted to have a seat of power. I propose 1) We abolish the prime minister position and give all its duties to the president 2) We abolish the president position and give all its duties to the prime minister 3) We remove both and have all MPs have admin<br><b>Alan:</b> Against- this system was designed so no one person holds all the power.<br><b>Twaddle:</b> Ok well first off we always have had a server owner who technically holds all the power<br><b>Twaddle:</b> Second the president and prime minister roles are just both people who maintain the general upkeep of the server, apart from this no addition perks are gained by their<br><b>Twaddle:</b> <i>either<br><b>Alan:</b> Ministries?<br><b>Twaddle:</b> Ok so tell me why we need two people to do this simple job if we have ministries as well?<br><b>Twaddle:</b> For (I)<br><b>Twaddle:</b> <i> For (1)<br><b>Twaddle:</b> Also <span class=\"ping\">@Alan</span> can you please show me the thread where the prime minister and president were introduced in the first place?<br><b>Twaddle:</b> Not claiming it doesn’t exist I just can’t find it<br><b>Alan:</b> https://discord.com/channels/907657508292792342/922102734331707463/922102737221586965<br><b>Alan:</b> The PM appoints ministries!<br><b>Alan:</b> The President is server owner.<br><b>Alan:</b> Obviously the bit about counting laws is obsolete now.<br><b>Twaddle:</b> One person voted<br><b>Twaddle:</b> That was it<br><b>Twaddle:</b> The rest didn’t care so we were forced to adopt your way<br><b>Alan:</b> <i>two<br><b>Twaddle:</b> Also this all useless because it’s a constitutional matter<br><b>Alan:</b> Yes<br><b>Alan:</b> This is what I have been thinking the whole time<br><b>Louis:</b> ```py<br>await message.channel.archive()<br>```<br><b>R. Louis:</b> ```py<br>Traceback (most recent call last):<br>  File \"/home/esmecat/dev/cheezland_utils/main.py\", line 178, in on_message<br>    await env[\"func\"]()<br>  File \"<string>\", line 3, in func<br>AttributeError: 'Thread' object has no attribute 'archive'<br>```<br><b>Louis:</b> ```py<br>await message.channel.edit(archived=True, locked=True)<br>```<br>"
		},
		{
			"id": "932674698196709436",
			"last_message_id": "932675688086007838",
			"name": "Trademark Laws",
			"votes": "2-for-0-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Trademarks are like copyrights but apply to names of things (like RoboLouis), they are also managed by the copyright office. People can use this in everyday speech, however they cannot use it for commercial or monetary reasons. Normal rules surrounding Copyright and Court cases apply.<br><b>Alan:</b> For<br><b>Twaddle:</b> For<br>"
		},
		{
			"id": "932673831775121410",
			"last_message_id": "933754271177011300",
			"name": "Our political situation",
			"votes": "4-for-1-against",
			"passed": true,
			"constitution": true,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Our political situation is a bit weird the only reason we have a prime minister and a president is purely because Alan wanted to have a seat of power. I propose 1) We abolish the prime minister position and give all its duties to the president 2) We abolish the president position and give all its duties to the prime minister 3) We remove both and have all MPs have admin<br><b>Twaddle:</b> For (1)<br><b>Alan:</b> Against<br><b>Louis:</b> For (3)<br><b>Louis:</b> ANARCHY ANARCHY ANARCHY<br><b>Twaddle:</b> @everyone<br><b>Elliot:</b> For (3)<br><b>Elliot:</b> https://tenor.com/view/chaos-gif-22919457<br><b>Twaddle:</b> <span class=\"ping\">@Adam</span><br><b>Adam:</b> For<br><b>Adam:</b> what could go wrong but isn't Alan the PM ur giving the power to<br><b>Louis:</b> which option are you voting for<br><b>Louis:</b> note the use of `for` in that message :0<br><b>Alan:</b> <span class=\"ping\">@Adam</span> vote against to stop New New Cheeseland from dissolving into anarchy!<br><b>Alan:</b> Everything would collapse<br><b>Twaddle:</b> <span class=\"ping\">@Adam</span> vote to remove the prime minister as it is useless and pointless<br><b>Alan:</b> It is not useless! It clearly has a job: to manage the government ministries!<br><b>Adam:</b> too late Alan, I vote For<br><b>Louis:</b> for what though?<br><b>Louis:</b> there are 3 options<br><b>Alan:</b> You can always change!<br><b>Louis:</b> Looks like anarchy is in for the win!!<br><b>Alan:</b> #order<br><b>Alan:</b> #government<br><b>Louis:</b> https://tenor.com/view/chaos-smug-christina-ricci-addams-family-addams-family-values-gif-11801830<br><b>Alan:</b> http://www.animateshadows.org/thoughts<br><b>Alan:</b> For (1)<br><b>Alan:</b> For (3)<br><b>Louis:</b> For (1)<br><b>Adam:</b> what?<br><b>Adam:</b> I'm confused<br><b>Twaddle:</b> Please send “For (1)”<br><b>Adam:</b> For (1)<br><b>Alan:</b> We are all changing our votes!<br><b>Adam:</b> ummm ok...<br><b>Alan:</b> Do you know what that actually means?<br><b>Adam:</b> I mean I though anarchy had won<br><b>Alan:</b> No<br><b>Alan:</b> Against<br><b>Alan:</b> <span class=\"ping\">@Adam</span> vote against today!<br><b>Adam:</b> nah I don't want a pm<br><b>Adam:</b> cuz they have all the power<br><b>Adam:</b> for there to be a preseitent there cannot be a pm<br><b>Adam:</b> and vice versa<br><b>Alan:</b> Not true<br><b>Twaddle:</b> Shush<br><b>Twaddle:</b> Stop<br><b>Alan:</b> You are restricting my freedom of speech<br><b>Louis:</b> <span class=\"ping\">@Elliot</span> come and abolish the prime minister with us<br><b>Elliot:</b> No<br><b>Elliot:</b> Send for(3)<br><b>Alan:</b> For (3)<br><b>Alan:</b> Against<br><b>Elliot:</b> Why are you changing votes?<br><b>Elliot:</b> Apart from to confuse<br><b>Twaddle:</b> No I just told you to shush, this is not restricting your freedom of speech I just wanted you to shush<br><b>Elliot:</b> Yeah he was just expressing an opinion<br><b>Alan:</b> Tactical voting!<br><b>Elliot:</b> As long as he is not putting a gag in your mouth it’s ok<br><b>Elliot:</b> Wait Louis I thought you were For (3)<br><b>Alan:</b> Putting a gag in my mouth is not ok!<br><b>Louis:</b> Alan's being irritating with voting<br><b>Elliot:</b> Mistype sorry!<br><b>Louis:</b> We must vote for 1 otherwise it won't pass<br><b>Elliot:</b> I corrected<br><b>Elliot:</b> Oh ok<br><b>Elliot:</b> For (1)<br><b>Alan:</b> Against<br><b>Louis:</b> Yay!<br><b>Elliot:</b> I think I should go practice English<br><b>Alan:</b> You do have an English test period 1<br><b>Elliot:</b> On my favourite gcse study site: nekos.life<br><b>Twaddle:</b> So do I! I haven’t revised at all!<br><b>Louis:</b> So am I<br>"
		},
		{
			"id": "933028735404351498",
			"last_message_id": "933030249736863825",
			"name": "Re-value our cheesecoin",
			"votes": "0-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Remove 100 cheesecoin from the treasury, lowering us to 400cc in circulation<br><b>Alan:</b> Against<br><b>Alan:</b> This law is completely useless.<br><b>Louis:</b> I want only 1cc in circulation<br><b>Louis:</b> Against<br><b>Twaddle:</b> This shall be re-proposed as a constitutional amenities<br><b>Alan:</b> Why?<br><b>Twaddle:</b> You said it was useless?<br><b>Twaddle:</b> I thought a constitution was against it?<br><b>Twaddle:</b> <span class=\"ping\">@Alan</span><br><b>Alan:</b> Which one?<br><b>Alan:</b> I said the law was useless, that does not necessarily mean that it was because it needed to override the constitution.<br><b>Twaddle:</b> <span class=\"ping\">@Louis</span> please close this thread<br><b>Alan:</b> Louis doesn’t have admin…<br>"
		},
		{
			"id": "933029626119323648",
			"last_message_id": "933036669010083900",
			"name": "Revalue cheesecoin",
			"votes": "1-for-2-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> Remove 100cc from treasury leaving 400 in circulation<br><b>Alan:</b> Against<br><b>Louis:</b> What?<br><b>Louis:</b> Why are we making a constitutional thread Twaddle?<br><b>Twaddle:</b> For<br><b>Louis:</b> Against<br><b>Twaddle:</b> This will help the problem of cash flow being almost nonexistent by having all currency in circulation become more valuable<br><b>Alan:</b> No it won’t<br><b>Twaddle:</b> So why do you oppose this change?<br><b>Alan:</b> Because it’s useless<br><b>Twaddle:</b> You are the sole holder of the treasury.<br><b>Alan:</b> It will change the number of CheeseCoins that exist, however the cashflow will remain the same as the removed CheeseCoin were stagnant in the treasury.<br><b>Twaddle:</b> Yes so why do they exist?<br><b>Alan:</b> They may enter circulation in the future.<br><b>Alan:</b> They provide ballast so the treasury doesn’t go bankrupt.<br><b>Twaddle:</b> You may as well just give the treasury infinite cheesecoin for this<br><b>Twaddle:</b> Also you still would have over 100 cheesecoin in the treasury to fall back upon<br>"
		},
		{
			"id": "933030807117914142",
			"last_message_id": "933274018851721226",
			"name": "Charge to propose laws",
			"votes": "0-for-3-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Twaddle:</b> This is completely fair and anyone can become an MP and gain 2cc a day through MP rollcall the charge will be 2 cc to propose a new law and 5cc to propose a new constitutional amendment<br><b>Louis:</b> Against -  it should always be free to propose a law<br><b>Alan:</b> Against<br><b>Alan:</b> This is restricting democracy and handing power to the rich!<br><b>James:</b> Wywine6<br><b>James:</b> Against<br><b>Twaddle:</b> Yeah this sucks<br><b>Twaddle:</b> <span class=\"ping\">@Alan</span> please clos this thread<br><b>Twaddle:</b> It was a bad idea<br><b>Alan:</b> No<br><b>Alan:</b> That would be illegal<br><b>Alan:</b> You are restricting my freedom of speech by not allowing me to type in this thread!<br>"
		},
		{
			"id": "932662722246639656",
			"last_message_id": "932909002965254185",
			"name": "Exceptions to freedom of speech",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": true,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Alan:</b> Prison overrides freedom of speech, so you can imprison someone without this being illegal. If /imprison is used incorrectly then a court case must be held.<br><b>Louis:</b> Bdbehhdbajsbdihdjdjvsiagjahvdjdbfkhddudjhdjdhsvdidbdhbdiebridv s be against BD djd djvshsvd<br><b>Alan:</b> For<br>"
		},
		{
			"id": "908424112576290856",
			"last_message_id": "909862332753125466",
			"name": "Banning Twaddle from parliament",
			"votes": "2-for-1-against",
			"passed": true,
			"constitution": false,
			"status": "Passed",
			"interpretation": "",
			"description": "<b>Louis:</b> I propose a bill which will ban Twaddle from getting the vote. (please ignore this)... <br><br>I actually want a restriction on how often you can change which party you are affiliated with - of course you can be not affiliated with a party at any time you want, but perhaps a sane limit to keep the power dynamics from shifting so dramatically? Perhaps one party per day per person is reasonable, if anyone has a better idea (hopefully more strict!) then please do suggest in the thread. I hope that this will be able to curb the (too) fast changes in who has power and make it possible for people who are in power to actually implement things instead of being kicked out.<br><b>Louis:</b> It would also be nice to have standards that all parties have to conform to if they want to be recognised as an official party e.g. a manifesto or a proper name. But this can be done another time...<br><b>Twaddle:</b> Against<br><b>James:</b> In favour.<br><b>Louis:</b> Can I vote on my own bills?<br><b>Twaddle:</b> Two points here<br><b>Twaddle:</b> a)James must make the bills as he is party leader<br><b>Twaddle:</b> b)he may not do it now as Elliott is in power<br><b>Louis:</b> Anyone can propose laws if they want?<br><b>Louis:</b> Actually I will have to ask <span class=\"ping\">@Alan</span> if this is true.<br><b>Louis:</b> Restriction on the amount of parties you can join per day<br><b>Xohng Xina and De Wok:</b> In favour<br><b>Xohng Xina and De Wok:</b> This law was passed as Twaddle being banned BEFORE the name being changed<br><b>Xohng Xina and De Wok:</b> So effectively Twaddle has been banned<br><b>Xohng Xina and De Wok:</b> Banning Twaddle from parliament<br><b>Xohng Xina and De Wok:</b> However, I will allow people another 24 hours to further debate this but currently Twaddle is losing this<br><b>Xohng Xina and De Wok:</b> Yes<br><b>Xohng Xina and De Wok:</b> <span class=\"ping\">#Banning Twaddle from parliament</span>  please continue this debate<br><b>Louis:</b> To be clear - the point of this <b>was not</b> to ban Twaddle from parliament, I think that would be unfair. I just wanted to place a restriction on how many parties you can join per day. I also would not vote for anyone, including Twaddle, to be banned from parliament nor propose a bill that would do this.<br><b>Xohng Xina and De Wok:</b> Except that's what you put<br><b>Louis:</b> > (Actually this is not the main point of this so please ignore)<br><b>Xohng Xina and De Wok:</b> <br><b>Xohng Xina and De Wok:</b> Ok then<br><b>Twaddle:</b> I am not sure what conclusion has been reached here<br><b>Twaddle:</b> Was Louis deemed correct?<br><b>Xohng Xina and De Wok:</b> Neither<br><b>Xohng Xina and De Wok:</b> 🙃<br><b>Twaddle:</b> I propose two ways this matter could be solved<br><b>Twaddle:</b> a)We could have a vote with the MPs about wether they think Elliott or Louis is correct<br><b>Twaddle:</b> b)We have a neutral person i.e Alan to decide who is correct after hearing both arguments<br><b>Twaddle:</b> I shall leave it to Elliott and Louis to decide<br><b>Twaddle:</b> <span class=\"ping\">@Xohng Xina and De Wok</span> <span class=\"ping\">@Louis</span><br><b>Louis:</b> I don't think there is anything to decide.<br><b>Alan:</b> I as I am neutral I think I should decide who decides how we decide this matter<br><b>Alan:</b> Whatever it is<br><b>Louis:</b> what do you think should happen then?<br><b>Twaddle:</b> We shall talk with Elliott and see if he agrees to have Alan sort this matter<br><b>Alan:</b> Just keeping this unarchived so we can ‘investigate’<br><b>Alan:</b> As there is no longer any voting taking place, this channel is set to archive after 1 hours<br>"
		},
		{
			"id": "908452523038347264",
			"last_message_id": "908996568634499122",
			"name": "Economy kickstart",
			"votes": "1-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>Xohng Xina and De Wok:</b> <span class=\"ping\">#parliament</span>  Alan and I propose the following: This is the GEMP (Grand Master Economic Plan). If you agree propose it as a law in <span class=\"ping\">#parliament</span> and start a new thread.<br><br>\t•\tThe bank shall print 500 Cheesecoins<br>\t•\tIt shall give 350 Cheesecoins to the government and keep 150 Cheesecoins.<br>\t•\tCitizens may take a loan from the bank with an interest rate of 10%<i>, or deposit into a savings account with an interest rate of 15%.<br>\t•\tIf the government deems it good enough, they may award a 10c grant to kickstart a business.<br>\t•\tThe government sets a tax rate and collects this daily, at 17:00. They can introduce income, business, wealth and sales taxes or any other type of tax for that matter, but this must be voted upon.<br>\t•\tThe government uses money for whatever they want to (up to the current party to decide)<br>\t•\tIn extreme circumstances the prime minister can give the bank permission to print a limited amount of money.<br>\t•\tThe government can subsidise (cover a % of the costs of) a business if they believe it has social, political or economic value.<br>\t•\tIt is recommended that the government incentivises citizens to buy products ie Twaddle’s food laws.<br><br></i>All interest rates are compound<br><b>Twaddle:</b> I agree<br><b>Twaddle:</b> This is genuinely sensible and a good idea<br><b>Louis:</b> This sounds like capitalism 👀<br><b>James:</b> strongly against.<br><b>Twaddle:</b> Could we please have some more votes in here?<br><b>Twaddle:</b> <span class=\"ping\">@Chino</span><br><b>Twaddle:</b> <span class=\"ping\">@Elliot</span><br><b>Xohng Xina and De Wok:</b> I agree<br><b>Twaddle:</b> <span class=\"ping\">@Adam</span><br><b>Adam:</b> hmm yes?<br><b>Adam:</b> (ping me with the info attached pls)<br><b>Twaddle:</b> <span class=\"ping\">@Adam</span> scroll up like 15 messages or so<br><b>Adam:</b> voted for it<br><b>Alan:</b> Can anyone else see the thread history here?<br><b>Xohng Xina and De Wok:</b> Yes<br><b>Alan:</b> I cannot<br><b>Xohng Xina and De Wok:</b> U should<br><b>Alan:</b> But don’t resend it or anything<br><b>Alan:</b> What was the vote?<br><b>Louis:</b> strongly against<br><b>Xohng Xina and De Wok:</b> The overall vote was for the motion to be carried<br><b>Xohng Xina and De Wok:</b> Saying that you are strongly for or against does not increase your voting power<br><b>Alan:</b> I will begin work sorting things out<br><b>Louis:</b> 😦<br>"
		},
		{
			"id": "907708087463460925",
			"last_message_id": "908423622379597864",
			"name": "Non profit organsiations",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>James:</b> I propose a new set of laws allowing non profits like <span class=\"ping\">#short-story-long</span> to continue.<br><br>Under these new laws non profits will get a 1 week trial where they can consider suggestions by the government and their progress will be closely monitored. After this trial the government can decide to do one of three things to the nonprofit<br>1. If it is deemed a great benefit then the core members will be fed by the party.<br>2. If it is considered inconsequential then it will be allowed to continue but members must also work in another job in order to get food<br>3. If it is considered bad for new cheeseland it will be shut down immediately.<br>After the trial if the nonprofit changes to become inconsequential or bad for new cheeseland then it will be shut down.<br><br>If this law is not passed then the government will have no control over nonprofits and nonprofit members will not get fed by the party.<br><br>Vote and discuss in this thread. Once the thread is archived the voting will end.<br><b>Louis:</b> Vote yes or have no food 🤪!<br><b>Elliot:</b> Yes!<br><b>Elliot:</b> louis you didnt actually directly say yes<br><b>Elliot:</b> so do that<br><b>Alan:</b> I only want the law where I have to change my name changed<br><b>Elliot:</b> so... is that a yes?<br><b>Alan:</b> Because I do not believe it to be harmful to New Cheeseland as I believe it is honestly quite accurate<br><b>Alan:</b> So I vote yes<br><b>Elliot:</b> does the law have to be the majority?<br><b>Elliot:</b> or just at least half<br><b>Alan:</b> They’re the same as it’s a yes or no<br><b>Elliot:</b> so<br><b>Elliot:</b> its already through<br><b>Alan:</b> I do believe we won<br><b>Elliot:</b> nice!<br><b>Alan:</b> Provided Louis voted yes<br><b>Elliot:</b> oh<br><b>Alan:</b> I suspect he did<br><b>Louis:</b> I did<br><b>Elliot:</b> so can i put it in law section?<br><b>Louis:</b> Where can I register/request the creation of a nonprofit organisation<br><b>James:</b> Request the creation of nonprofits in <span class=\"ping\">#new-nonprofit-requests</span>. Your police nonprofit has been created in <span class=\"ping\">#police</span><br><b>Twaddle:</b> Against<br><b>James:</b> This law has already been passed so your vote is invalid.<br><b>Twaddle:</b> No it has not been<br><b>Twaddle:</b> Talk to Alan<br><b>James:</b> This is lies.<br><b>James:</b> It is in the <span class=\"ping\">#laws</span><br><b>James:</b> .............<br>"
		},
		{
			"id": "908061006767460432",
			"last_message_id": "908421721122541589",
			"name": "Ban on for-profit organisations",
			"votes": "2-for-3-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>James:</b> Currently in New New Cheeseland we are facing several issues including poverty, homelessness and political unrest. A rich / poor divide and millions of pounds of debts are looking likely if we continue in this Capitalist manner.<br><br>The tetra party propose to solve this by implementing a ban on for-profit businesses.<br><br>Vote and discuss in this thread. Once the thread is archived the voting will end.<br><b>James:</b> A am in favour as this would combat one of the many problems facing New New Cheeseland.<br><b>Elliot:</b> In favour, we really need to have this sorted.<br><b>Elliot:</b> every other time we try new cheeselannd we end up with a big gap  between those who are more active and good at bringing in random people for their vote, we need that to be demolished and hard work should be the only source of power. New Cheeseland was a mess, why should we repeat our capitalist mistakes. Communism is the future<br><b>Louis:</b> I am in favour.<br><b>Chino:</b> I vote against it<br><b>Twaddle:</b> Against<br><b>Twaddle:</b> <span class=\"ping\">@Xohng Xina and De Wok</span> come vote against or your entire party’s basis will crumble<br><b>Xohng Xina and De Wok:</b> Sure i am against<br>"
		},
		{
			"id": "908058529817034753",
			"last_message_id": "908383514423091271",
			"name": "New player restrictions",
			"votes": "1-for-1-against",
			"passed": false,
			"constitution": false,
			"status": "Not passed",
			"interpretation": "",
			"description": "<b>James:</b> Elliott proposes new laws restricting the elegability of new players to join a political party:<br><br>Under these new laws members will only get to vote in <span class=\"ping\">#parliament</span> if they have been in the country for 2 days and are on discord. These laws also state that political parties have to contain two or more members or else they will be dissolved.<br><br>He states that \"this is because we need to maintain the order and democracy of Cheeseland rather than let it crumble to a popularity contest (in which I would win). For example, the reason for me recently being established as prime minister is because I just asked a random person to join. This should be ceased and cheeseland should be more lawful. That is why I propose that new members of cheeseland should not be able to immediately join a party.\"<br><br>Vote and discuss in this thread. Once the thread is archived the voting will end.<br><b>James:</b> I am in favour as this would promote a more diverse political scene.<br><b>Xohng Xina and De Wok:</b> Yes sounds vry good<br><b>James:</b> which party are you in?<br><b>Xohng Xina and De Wok:</b> I am in favour<br><b>Xohng Xina and De Wok:</b> I also am not Cameron<br><b>Xohng Xina and De Wok:</b> I am Elliott<br><b>Xohng Xina and De Wok:</b> Why it say cameron<br><b>Louis:</b> I am also in favour<br><b>Xohng Xina and De Wok:</b> The DNI party<br><b>Chino:</b> I am in favour of it<br><b>Twaddle:</b> Against<br>"
		}
	]
}